{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/raymond/Desktop/georgetown/Spring_semester_2021-2022/TA for Jensen/office_hours/thesis_stata_code.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Apr 2022, 11:16:42

{com}. do "/var/folders/wd/psxpt0xs5t70gsr2091jc_c80000gn/T//SD14159.000000"
{txt}
{com}. clear all
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/wd/psxpt0xs5t70gsr2091jc_c80000gn/T//SD14159.000000"
{txt}
{com}. clear all
{res}{txt}
{com}. use "/Users/raymond/Desktop/georgetown/CGSS/cgss2010_14.dta"
{txt}
{com}. *narrow down
. drop if a18!=1
{txt}(5,743 observations deleted)

{com}. drop if a21!=1
{txt}(1,121 observations deleted)

{com}. *voting behavior
. gen vote = .
{txt}(4,919 missing values generated)

{com}. replace vote = 1 if a44 == 1
{txt}(3,153 real changes made)

{com}. replace vote = 0 if a44 == 2
{txt}(1,641 real changes made)

{com}. label variable vote "Voting in the past three years"
{txt}
{com}. label define vote_label 0 "No" 1 "Yes"
{txt}
{com}. label values vote vote_label
{txt}
{com}. *political trust
. gen level = .
{txt}(4,919 missing values generated)

{com}. replace level = 1 if d303 == 1
{txt}(256 real changes made)

{com}. replace level = 2 if d303 == 2
{txt}(587 real changes made)

{com}. replace level = 3 if d303 == 3
{txt}(786 real changes made)

{com}. replace level = 4 if d303 == 4
{txt}(1,885 real changes made)

{com}. replace level = 5 if d303 == 5
{txt}(1,380 real changes made)

{com}. label variable level "Trust level"
{txt}
{com}. label define level_label 1 "Not trustworthy at all" 2 "Not Trustworthy" 3 "Neutral" 4 "Trustworthy" 5 "Very trustworthy"
{txt}
{com}. label values level level_label
{txt}
{com}. *trust or not
. gen trust = .
{txt}(4,919 missing values generated)

{com}. replace trust = 1 if level > 3 & level <= 5
{txt}(3,265 real changes made)

{com}. replace trust = 0 if level <= 3
{txt}(1,629 real changes made)

{com}. label variable trust "Trust in local government"
{txt}
{com}. label define trust_label 0 "No" 1 "Yes"
{txt}
{com}. label values trust trust_label
{txt}
{com}. *b4(未来五年是否考虑到城镇定居）可以考虑做工具变量
. gen livurban = .
{txt}(4,919 missing values generated)

{com}. replace livurban = 0 if b4 == 2
{txt}(3,896 real changes made)

{com}. replace livurban = 1 if b4==1 | b4 == 3
{txt}(634 real changes made)

{com}. *b9可做工具变量 短期回家
. gen back =.
{txt}(4,919 missing values generated)

{com}. replace back =1 if b9==2
{txt}(155 real changes made)

{com}. replace back=0 if b9==1|b9==3|b9==4|b9==5
{txt}(4,391 real changes made)

{com}. *承包土地作为工具变量
. replace b111=. if b111==-2|b111==-3
{txt}(62 real changes made, 62 to missing)

{com}. replace b112=. if b112==-2|b112==-3
{txt}(77 real changes made, 77 to missing)

{com}. replace b113=. if b113==-2|b113==-3
{txt}(63 real changes made, 63 to missing)

{com}. replace b114=. if b114==-2|b114==-3
{txt}(64 real changes made, 64 to missing)

{com}. gen subcontract = log(b111+b112+b113+b114)
{txt}(634 missing values generated)

{com}. 
. gen sub =. 
{txt}(4,919 missing values generated)

{com}. replace sub=1 if a91==1
{txt}(4,168 real changes made)

{com}. replace sub=0 if a91==2
{txt}(750 real changes made)

{com}. *家庭农业人口
. replace b22=. if b22==-1|b22==-2
{txt}(4 real changes made, 4 to missing)

{com}. gen big=.
{txt}(4,919 missing values generated)

{com}. replace big=1 if b22>2 & b22<=8
{txt}(840 real changes made)

{com}. replace big=0 if b22<=2&b22>=0
{txt}(3,676 real changes made)

{com}. *房产
. 
. *age
. gen age =.
{txt}(4,919 missing values generated)

{com}. replace age = 2010-a3a
{txt}(4,919 real changes made)

{com}. label variable age "Age"
{txt}
{com}. *educ & prim_scho
. gen educ=.
{txt}(4,919 missing values generated)

{com}. replace educ=1 if a7a==1
{txt}(1,105 real changes made)

{com}. replace educ=2 if a7a==2|a7a==3
{txt}(1,748 real changes made)

{com}. replace educ=3 if a7a==4
{txt}(1,575 real changes made)

{com}. replace educ=4 if a7a==5|a7a==6|a7a==7|a7a==8
{txt}(421 real changes made)

{com}. replace educ=5 if a7a==9|a7a==10|a7a==11|a7a==12
{txt}(67 real changes made)

{com}. replace educ=6 if a7a==13
{txt}(1 real change made)

{com}. replace educ=7 if a7a==14
{txt}(1 real change made)

{com}. gen prim_scho =.
{txt}(4,919 missing values generated)

{com}. replace prim_scho = 0 if educ == 1 | educ==2
{txt}(2,853 real changes made)

{com}. replace prim_scho = 1 if educ == 3 | educ==4 | educ==5 | educ==6 | educ==7
{txt}(2,065 real changes made)

{com}. label variable prim_scho "Junior high school or above"
{txt}
{com}. label define schol_label 0 "No" 1 "Yes"
{txt}
{com}. label values prim_scho schol_label
{txt}
{com}. *income
. gen lg_inc =.
{txt}(4,919 missing values generated)

{com}. replace lg_inc=log(a8a+1) if a8a!=9999997&a8a!=9999998&a8a!=9999999
{txt}(4,366 real changes made)

{com}. *ethnicity
. gen Han = .
{txt}(4,919 missing values generated)

{com}. replace Han =1 if a4 == 1
{txt}(4,358 real changes made)

{com}. replace Han=0 if a4 == 2 | a4==3| a4==4 |a4 == 5 | a4==6| a4==7|a4==8
{txt}(554 real changes made)

{com}. label variable Han "Han people"
{txt}
{com}. label define han_label 0 "No" 1 "Yes"
{txt}
{com}. label values Han han_label
{txt}
{com}. *male
. gen male = .
{txt}(4,919 missing values generated)

{com}. replace male =1 if a2==1
{txt}(2,408 real changes made)

{com}. replace male=0 if a2==2
{txt}(2,511 real changes made)

{com}. label variable male "Gender"
{txt}
{com}. label define gender_label 0 "Female" 1 "Male"
{txt}
{com}. label values male gender_label
{txt}
{com}. *marriage
. gen mar = .
{txt}(4,919 missing values generated)

{com}. replace mar =1 if a69 ==3
{txt}(4,122 real changes made)

{com}. replace mar=0 if a69==1 | a69==2|a69==4 |a69==5| a69==6
{txt}(796 real changes made)

{com}. label variable mar "Married"
{txt}
{com}. label define mar_label 0 "No" 1 "Yes"
{txt}
{com}. label values mar mar_label
{txt}
{com}. *health status
. gen health =.
{txt}(4,919 missing values generated)

{com}. replace health =1 if a15 == 4|a15==5
{txt}(2,691 real changes made)

{com}. replace health =0 if a15==1|a15==2|a15==3
{txt}(2,225 real changes made)

{com}. label variable health "Perceived health status"
{txt}
{com}. label define heal_label 0 "Not healthy" 1 "Healthy"
{txt}
{com}. label values health heal_label
{txt}
{com}. *status
. gen below_aver = .
{txt}(4,919 missing values generated)

{com}. replace below_aver =1 if a64 == 1|a64==2
{txt}(2,196 real changes made)

{com}. replace below_aver=0 if a64==3|a64==4|a64==5
{txt}(2,719 real changes made)

{com}. label variable below_aver "Perceived economic status"
{txt}
{com}. label define eco_label 0 "Equal to or above local average level" 1 "Below local average level"
{txt}
{com}. label values below_aver eco_label
{txt}
{com}. *internet
. gen internet = .
{txt}(4,919 missing values generated)

{com}. replace internet=0 if a285==1
{txt}(4,273 real changes made)

{com}. replace internet=1 if a285==2|a285==3|a285==4|a285==5
{txt}(641 real changes made)

{com}. label variable internet "Internet usage in 2009"
{txt}
{com}. label define inter_label 0 "Never used" 1 "Have used"
{txt}
{com}. label values internet inter_label
{txt}
{com}. *party
. gen party = .
{txt}(4,919 missing values generated)

{com}. replace party = 1 if a10 == 1
{txt}(251 real changes made)

{com}. replace party=0 if a10==2 | a10==3|a10==4
{txt}(4,662 real changes made)

{com}. label variable party "CCP member"
{txt}
{com}. label define par_label 0 "No" 1 "Yes"
{txt}
{com}. label values party par_label
{txt}
{com}. *religion
. gen reli =.
{txt}(4,919 missing values generated)

{com}. replace reli=0 if a5==1
{txt}(4,235 real changes made)

{com}. replace reli=1 if a5==11|a5==12|a5==13|a5==14|a5==15|a5==16|a5==21
{txt}(684 real changes made)

{com}. label variable reli "Religious"
{txt}
{com}. label define reli_label 0 "No" 1 "Yes"
{txt}
{com}. label values reli reli_label
{txt}
{com}. *read
. gen read =.
{txt}(4,919 missing values generated)

{com}. replace read=0 if d111 == 1 | d111==2
{txt}(4,063 real changes made)

{com}. replace read=1 if d111==3|d111==4|d111==5
{txt}(835 real changes made)

{com}. label variable read "Not seldom reads newspapers, magazines, or books about current events in 2009"
{txt}
{com}. label define read_label 0 "No" 1 "Yes"
{txt}
{com}. label values read read_label
{txt}
{com}. *submit
. gen submit =.
{txt}(4,919 missing values generated)

{com}. replace submit=1 if d95==4|d95==5
{txt}(4,022 real changes made)

{com}. replace submit=0 if d95==1|d95==2|d95==3
{txt}(875 real changes made)

{com}. label variable submit "Ordinary people should be submissive to the authority"
{txt}
{com}. label define sub_label 0 "No" 1 "Yes"
{txt}
{com}. label values submit sub_label
{txt}
{com}. 
. *complicated
. gen compli =.
{txt}(4,919 missing values generated)

{com}. replace compli=1 if d1001==4|d1001==5
{txt}(3,469 real changes made)

{com}. replace compli=0 if d1001==1|d1001==2|d1001==3
{txt}(1,412 real changes made)

{com}. label variable compli "Politics is complicated"
{txt}
{com}. label define com_label 0 "No" 1 "Yes"
{txt}
{com}. label values compli com_label
{txt}
{com}. *no influence
. gen no_influ=.
{txt}(4,919 missing values generated)

{com}. replace no_influ=1 if d1004==4|d1004==5
{txt}(3,150 real changes made)

{com}. replace no_influ=0 if d1004==1|d1004==2|d1004==3
{txt}(1,716 real changes made)

{com}. label variable no_influ "Ordinary people have no influence on politics"
{txt}
{com}. label define inf_label 0 "No" 1 "Yes"
{txt}
{com}. label values no_influ inf_label
{txt}
{com}. *capable
. gen cap =.
{txt}(4,919 missing values generated)

{com}. replace cap=1 if d1002==4|d1002==5
{txt}(1,046 real changes made)

{com}. replace cap=0 if d1002==1|d1002==2|d1002==3
{txt}(3,830 real changes made)

{com}. label variable cap "Competent to engage in politics"
{txt}
{com}. label define cap_label 0 "No" 1 "Yes"
{txt}
{com}. label values cap cap_label
{txt}
{com}. *TV
. gen tv=.
{txt}(4,919 missing values generated)

{com}. replace tv=1 if a284==4|a284==5
{txt}(3,781 real changes made)

{com}. replace tv=0 if a284==1|a284==2|a284==3
{txt}(1,135 real changes made)

{com}. label variable tv "Often watched TV in 2009"
{txt}
{com}. label define tv_label 0 "No" 1 "Yes"
{txt}
{com}. label values tv tv_label
{txt}
{com}. *region
. gen region=.
{txt}(4,919 missing values generated)

{com}. replace region=1 if s41==1|s41==4|s41==10|s41==12|s41==15|s41==17|s41==19|s41==20|s41==24
{txt}(1,052 real changes made)

{com}. replace region=2 if s41==5|s41==31|s41==27
{txt}(564 real changes made)

{com}. replace region=3 if s41==9|s41==11|s41==16|s41==18|s41==21|s41==22
{txt}(1,583 real changes made)

{com}. replace region=4 if s41==2|s41==3|s41==6|s41==8|s41==13|s41==14|s41==23|s41==28|s41==29|s41==30|s41==26
{txt}(1,720 real changes made)

{com}. *separate regions
. tab region, gen(region1)

     {txt}region {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,052       21.39       21.39
{txt}          2 {c |}{res}        564       11.47       32.85
{txt}          3 {c |}{res}      1,583       32.18       65.03
{txt}          4 {c |}{res}      1,720       34.97      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,919      100.00
{txt}
{com}. label variable region11 "East"
{txt}
{com}. label variable region12 "Northeast"
{txt}
{com}. label variable region13 "Center"
{txt}
{com}. label variable region14 "West"
{txt}
{com}. *生成交互项
. gen vote_male= vote*male
{txt}(125 missing values generated)

{com}. gen vote_party= vote*party
{txt}(131 missing values generated)

{com}. 
. *impute values to lg_inc
.  impute lg_inc age prim_scho Han male mar health below_aver internet party reli read submit compli no_influ cap tv region12 region13 region14, gen(lg_inc_imputed)
{txt} 11.24% (553) observations imputed

{com}.  
. *descriptive analysis
. gen inc = exp(lg_inc_imputed)-1 //back to original stage and use this to do descriptive analysis
{txt}
{com}. label variable inc "Total personal income in 2009"
{txt}
{com}. 
. *把missing value全部drop掉
. drop if trust ==.
{txt}(25 observations deleted)

{com}. drop if vote ==.
{txt}(124 observations deleted)

{com}. drop if age ==.
{txt}(0 observations deleted)

{com}. drop if prim_scho ==.
{txt}(1 observation deleted)

{com}. drop if lg_inc_imputed ==.
{txt}(0 observations deleted)

{com}. drop if Han==. 
{txt}(7 observations deleted)

{com}. drop if male==. 
{txt}(0 observations deleted)

{com}. drop if mar==. 
{txt}(0 observations deleted)

{com}. drop if health==. 
{txt}(3 observations deleted)

{com}. drop if below_aver==.
{txt}(3 observations deleted)

{com}. drop if internet==.
{txt}(3 observations deleted)

{com}. drop if party==.
{txt}(6 observations deleted)

{com}. drop if reli==.
{txt}(0 observations deleted)

{com}. drop if read==.
{txt}(16 observations deleted)

{com}. drop if submit==. 
{txt}(13 observations deleted)

{com}. drop if compli==. 
{txt}(18 observations deleted)

{com}. drop if no_influ==. 
{txt}(27 observations deleted)

{com}. drop if cap==. 
{txt}(14 observations deleted)

{com}. drop if tv==. 
{txt}(2 observations deleted)

{com}. drop if region==.
{txt}(0 observations deleted)

{com}. 
. *formal regressions
. probit trust vote [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3385.2614}  
Iteration 1:{space 3}log pseudolikelihood = {res:-3356.0833}  
Iteration 2:{space 3}log pseudolikelihood = {res:-3356.0791}  
Iteration 3:{space 3}log pseudolikelihood = {res:-3356.0791}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:Wald chi2({res:1})}{col 70} = {res}{ralign 6:36.06}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-3356.0791}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0086}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .2835066{col 26}{space 2} .0472093{col 37}{space 1}    6.01{col 46}{space 3}0.000{col 54}{space 4}  .190978{col 67}{space 3} .3760352
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2369521{col 26}{space 2}  .009387{col 37}{space 1}   25.24{col 46}{space 3}0.000{col 54}{space 4} .2185539{col 67}{space 3} .2553503
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margin,dydx(*)
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(trust), predict()}{p_end}
{p2col:dy/dx wrt:}{res:vote}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .1026587{col 26}{space 2} .0152093{col 37}{space 1}    6.75{col 46}{space 3}0.000{col 54}{space 4} .0728491{col 67}{space 3} .1324683
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6624718    .0498875    .593653   .6986281
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,657 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,113 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,544      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,113      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3385.2614}  
Iteration 1:{space 3}log pseudolikelihood = {res:-3305.5464}  
Iteration 2:{space 3}log pseudolikelihood = {res:-3305.3182}  
Iteration 3:{space 3}log pseudolikelihood = {res:-3305.3182}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-3305.3182}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0236}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .2932534{col 26}{space 2} .0531184{col 37}{space 1}    5.52{col 46}{space 3}0.000{col 54}{space 4} .1891431{col 67}{space 3} .3973636
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1079735{col 26}{space 2}  .016353{col 37}{space 1}   -6.60{col 46}{space 3}0.000{col 54}{space 4}-.1400249{col 67}{space 3}-.0759222
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0019451{col 26}{space 2} .0010237{col 37}{space 1}    1.90{col 46}{space 3}0.057{col 54}{space 4}-.0000612{col 67}{space 3} .0039515
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.4393742{col 26}{space 2}  .038591{col 37}{space 1}  -11.39{col 46}{space 3}0.000{col 54}{space 4}-.5150111{col 67}{space 3}-.3637373
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.1306524{col 26}{space 2} .0183425{col 37}{space 1}   -7.12{col 46}{space 3}0.000{col 54}{space 4}-.1666031{col 67}{space 3}-.0947017
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}-.1441233{col 26}{space 2} .0385121{col 37}{space 1}   -3.74{col 46}{space 3}0.000{col 54}{space 4}-.2196056{col 67}{space 3}-.0686411
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7655698{col 26}{space 2} .0097961{col 37}{space 1}   78.15{col 46}{space 3}0.000{col 54}{space 4} .7463698{col 67}{space 3} .7847698
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margin,dydx(*)
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(trust), predict()}{p_end}
{p2col:dy/dx wrt:}{res:vote male age Han mar prim_scho}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .1044636{col 26}{space 2} .0178338{col 37}{space 1}    5.86{col 46}{space 3}0.000{col 54}{space 4}   .06951{col 67}{space 3} .1394171
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.0384626{col 26}{space 2} .0054299{col 37}{space 1}   -7.08{col 46}{space 3}0.000{col 54}{space 4}-.0491051{col 67}{space 3}-.0278201
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0006929{col 26}{space 2} .0003719{col 37}{space 1}    1.86{col 46}{space 3}0.062{col 54}{space 4}-.0000361{col 67}{space 3} .0014219
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.1565151{col 26}{space 2} .0153864{col 37}{space 1}  -10.17{col 46}{space 3}0.000{col 54}{space 4}-.1866719{col 67}{space 3}-.1263584
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.0465414{col 26}{space 2} .0070082{col 37}{space 1}   -6.64{col 46}{space 3}0.000{col 54}{space 4}-.0602771{col 67}{space 3}-.0328056
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}  -.05134{col 26}{space 2} .0131809{col 37}{space 1}   -3.90{col 46}{space 3}0.000{col 54}{space 4}-.0771742{col 67}{space 3}-.0255059
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6648447    .0804738   .4914069   .8877088
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,612 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,118 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,519       98.38       98.38
{txt}          1 {c |}{res}         25        1.62      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         20        0.64        0.64
{txt}          1 {c |}{res}      3,093       99.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc_imputed below_aver [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3385.2614}  
Iteration 1:{space 3}log pseudolikelihood = {res:-3300.7772}  
Iteration 2:{space 3}log pseudolikelihood = {res:-3300.5345}  
Iteration 3:{space 3}log pseudolikelihood = {res:-3300.5345}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-3300.5345}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0250}

{txt}{ralign 80:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .2874638{col 28}{space 2} .0548671{col 39}{space 1}    5.24{col 48}{space 3}0.000{col 56}{space 4} .1799262{col 69}{space 3} .3950014
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0864732{col 28}{space 2} .0139698{col 39}{space 1}   -6.19{col 48}{space 3}0.000{col 56}{space 4}-.1138534{col 69}{space 3}-.0590929
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0016562{col 28}{space 2} .0010878{col 39}{space 1}    1.52{col 48}{space 3}0.128{col 56}{space 4}-.0004758{col 69}{space 3} .0037882
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.4341032{col 28}{space 2} .0364949{col 39}{space 1}  -11.89{col 48}{space 3}0.000{col 56}{space 4}-.5056319{col 69}{space 3}-.3625746
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1216989{col 28}{space 2} .0216072{col 39}{space 1}   -5.63{col 48}{space 3}0.000{col 56}{space 4}-.1640483{col 69}{space 3}-.0793495
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1537731{col 28}{space 2} .0318614{col 39}{space 1}   -4.83{col 48}{space 3}0.000{col 56}{space 4}-.2162203{col 69}{space 3}-.0913258
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0110071{col 28}{space 2} .0024644{col 39}{space 1}   -4.47{col 48}{space 3}0.000{col 56}{space 4}-.0158373{col 69}{space 3}-.0061769
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1065434{col 28}{space 2} .0312131{col 39}{space 1}   -3.41{col 48}{space 3}0.001{col 56}{space 4}-.1677199{col 69}{space 3}-.0453668
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .8939797{col 28}{space 2}  .016983{col 39}{space 1}   52.64{col 48}{space 3}0.000{col 56}{space 4} .8606937{col 69}{space 3} .9272657
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margin,dydx(*)
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(trust), predict()}{p_end}
{p2col:dy/dx wrt:}{res:vote male age Han mar prim_scho lg_inc_imputed below_aver}{p_end}
{p2colreset}{...}

{res}{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28} Delta-method
{col 16}{c |}      dy/dx{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .1022476{col 28}{space 2} .0184723{col 39}{space 1}    5.54{col 48}{space 3}0.000{col 56}{space 4} .0660426{col 69}{space 3} .1384525
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0307575{col 28}{space 2} .0046548{col 39}{space 1}   -6.61{col 48}{space 3}0.000{col 56}{space 4}-.0398808{col 69}{space 3}-.0216342
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0005891{col 28}{space 2} .0003929{col 39}{space 1}    1.50{col 48}{space 3}0.134{col 56}{space 4} -.000181{col 69}{space 3} .0013592
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.1544055{col 28}{space 2} .0145574{col 39}{space 1}  -10.61{col 48}{space 3}0.000{col 56}{space 4}-.1829375{col 69}{space 3}-.1258735
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.0432869{col 28}{space 2} .0081192{col 39}{space 1}   -5.33{col 48}{space 3}0.000{col 56}{space 4}-.0592002{col 69}{space 3}-.0273736
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.0546953{col 28}{space 2} .0107731{col 39}{space 1}   -5.08{col 48}{space 3}0.000{col 56}{space 4}-.0758102{col 69}{space 3}-.0335804
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0039151{col 28}{space 2} .0008381{col 39}{space 1}   -4.67{col 48}{space 3}0.000{col 56}{space 4}-.0055578{col 69}{space 3}-.0022724
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.0378962{col 28}{space 2} .0114628{col 39}{space 1}   -3.31{col 48}{space 3}0.001{col 56}{space 4}-.0603629{col 69}{space 3}-.0154296
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6641243    .0826653   .4689648   .9044472
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,548 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,120 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,486       96.24       96.24
{txt}          1 {c |}{res}         58        3.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         51        1.64        1.64
{txt}          1 {c |}{res}      3,062       98.36      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3385.2614}  
Iteration 1:{space 3}log pseudolikelihood = {res:-3240.1301}  
Iteration 2:{space 3}log pseudolikelihood = {res:-3239.6758}  
Iteration 3:{space 3}log pseudolikelihood = {res:-3239.6757}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-3239.6757}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0430}

{txt}{ralign 80:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .2743696{col 28}{space 2} .0544371{col 39}{space 1}    5.04{col 48}{space 3}0.000{col 56}{space 4} .1676749{col 69}{space 3} .3810643
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0821961{col 28}{space 2} .0113423{col 39}{space 1}   -7.25{col 48}{space 3}0.000{col 56}{space 4}-.1044266{col 69}{space 3}-.0599656
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0003772{col 28}{space 2} .0007554{col 39}{space 1}    0.50{col 48}{space 3}0.618{col 56}{space 4}-.0011033{col 69}{space 3} .0018577
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.4363196{col 28}{space 2} .0281108{col 39}{space 1}  -15.52{col 48}{space 3}0.000{col 56}{space 4}-.4914158{col 69}{space 3}-.3812234
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1228031{col 28}{space 2} .0301357{col 39}{space 1}   -4.08{col 48}{space 3}0.000{col 56}{space 4}-.1818679{col 69}{space 3}-.0637382
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1288707{col 28}{space 2}  .026615{col 39}{space 1}   -4.84{col 48}{space 3}0.000{col 56}{space 4}-.1810352{col 69}{space 3}-.0767062
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0144466{col 28}{space 2} .0025502{col 39}{space 1}   -5.66{col 48}{space 3}0.000{col 56}{space 4}-.0194448{col 69}{space 3}-.0094484
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1172877{col 28}{space 2} .0306422{col 39}{space 1}   -3.83{col 48}{space 3}0.000{col 56}{space 4}-.1773453{col 69}{space 3}-.0572301
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0461049{col 28}{space 2} .0557644{col 39}{space 1}    0.83{col 48}{space 3}0.408{col 56}{space 4}-.0631914{col 69}{space 3} .1554011
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .5018792{col 28}{space 2} .0192269{col 39}{space 1}   26.10{col 48}{space 3}0.000{col 56}{space 4} .4641951{col 69}{space 3} .5395633
{txt}{space 11}cap {c |}{col 16}{res}{space 2} .0306501{col 28}{space 2} .0353938{col 39}{space 1}    0.87{col 48}{space 3}0.387{col 56}{space 4}-.0387205{col 69}{space 3} .1000208
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0698068{col 28}{space 2} .0434398{col 39}{space 1}    1.61{col 48}{space 3}0.108{col 56}{space 4}-.0153337{col 69}{space 3} .1549472
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0764303{col 28}{space 2} .0036705{col 39}{space 1}  -20.82{col 48}{space 3}0.000{col 56}{space 4}-.0836244{col 69}{space 3}-.0692362
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .5681525{col 28}{space 2} .0512997{col 39}{space 1}   11.08{col 48}{space 3}0.000{col 56}{space 4} .4676069{col 69}{space 3}  .668698
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margin,dydx(*)
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(trust), predict()}{p_end}
{p2col:dy/dx wrt:}{res:vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ}{p_end}
{p2colreset}{...}

{res}{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28} Delta-method
{col 16}{c |}      dy/dx{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .0956766{col 28}{space 2} .0180319{col 39}{space 1}    5.31{col 48}{space 3}0.000{col 56}{space 4} .0603347{col 69}{space 3} .1310186
{txt}{space 10}male {c |}{col 16}{res}{space 2} -.028663{col 28}{space 2} .0036749{col 39}{space 1}   -7.80{col 48}{space 3}0.000{col 56}{space 4}-.0358657{col 69}{space 3}-.0214602
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0001315{col 28}{space 2} .0002647{col 39}{space 1}    0.50{col 48}{space 3}0.619{col 56}{space 4}-.0003873{col 69}{space 3} .0006504
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.1521509{col 28}{space 2} .0113335{col 39}{space 1}  -13.42{col 48}{space 3}0.000{col 56}{space 4}-.1743642{col 69}{space 3}-.1299377
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.0428232{col 28}{space 2} .0109381{col 39}{space 1}   -3.92{col 48}{space 3}0.000{col 56}{space 4}-.0642614{col 69}{space 3} -.021385
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.0449391{col 28}{space 2}  .008835{col 39}{space 1}   -5.09{col 48}{space 3}0.000{col 56}{space 4}-.0622554{col 69}{space 3}-.0276228
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0050377{col 28}{space 2} .0008412{col 39}{space 1}   -5.99{col 48}{space 3}0.000{col 56}{space 4}-.0066864{col 69}{space 3} -.003389
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.0408999{col 28}{space 2} .0110819{col 39}{space 1}   -3.69{col 48}{space 3}0.000{col 56}{space 4}-.0626201{col 69}{space 3}-.0191797
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0160774{col 28}{space 2} .0196059{col 39}{space 1}    0.82{col 48}{space 3}0.412{col 56}{space 4}-.0223494{col 69}{space 3} .0545043
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .1750125{col 28}{space 2} .0052424{col 39}{space 1}   33.38{col 48}{space 3}0.000{col 56}{space 4} .1647377{col 69}{space 3} .1852874
{txt}{space 11}cap {c |}{col 16}{res}{space 2} .0106881{col 28}{space 2} .0124487{col 39}{space 1}    0.86{col 48}{space 3}0.391{col 56}{space 4}-.0137109{col 69}{space 3} .0350872
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0243426{col 28}{space 2} .0149038{col 39}{space 1}    1.63{col 48}{space 3}0.102{col 56}{space 4}-.0048683{col 69}{space 3} .0535535
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0266524{col 28}{space 2} .0014845{col 39}{space 1}  -17.95{col 48}{space 3}0.000{col 56}{space 4}-.0295619{col 69}{space 3}-.0237428
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6635571    .1101838    .305114   .9141006
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,204 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,166 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,291       83.61       83.61
{txt}          1 {c |}{res}        253       16.39      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        200        6.42        6.42
{txt}          1 {c |}{res}      2,913       93.58      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ i.region [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3385.2614}  
Iteration 1:{space 3}log pseudolikelihood = {res:-3200.6169}  
Iteration 2:{space 3}log pseudolikelihood = {res:-3199.8086}  
Iteration 3:{space 3}log pseudolikelihood = {res:-3199.8085}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-3199.8085}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0548}

{txt}{ralign 80:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .2260086{col 28}{space 2} .0577436{col 39}{space 1}    3.91{col 48}{space 3}0.000{col 56}{space 4} .1128333{col 69}{space 3} .3391839
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0731708{col 28}{space 2} .0042895{col 39}{space 1}  -17.06{col 48}{space 3}0.000{col 56}{space 4}-.0815781{col 69}{space 3}-.0647636
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0018012{col 28}{space 2} .0008063{col 39}{space 1}    2.23{col 48}{space 3}0.025{col 56}{space 4} .0002209{col 69}{space 3} .0033816
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.3599358{col 28}{space 2}  .048873{col 39}{space 1}   -7.36{col 48}{space 3}0.000{col 56}{space 4}-.4557251{col 69}{space 3}-.2641465
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1064609{col 28}{space 2} .0214191{col 39}{space 1}   -4.97{col 48}{space 3}0.000{col 56}{space 4}-.1484416{col 69}{space 3}-.0644802
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1207362{col 28}{space 2} .0196124{col 39}{space 1}   -6.16{col 48}{space 3}0.000{col 56}{space 4}-.1591758{col 69}{space 3}-.0822965
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0202958{col 28}{space 2} .0043118{col 39}{space 1}   -4.71{col 48}{space 3}0.000{col 56}{space 4}-.0287467{col 69}{space 3}-.0118448
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1428883{col 28}{space 2} .0300581{col 39}{space 1}   -4.75{col 48}{space 3}0.000{col 56}{space 4}-.2018012{col 69}{space 3}-.0839755
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0599625{col 28}{space 2} .0512583{col 39}{space 1}    1.17{col 48}{space 3}0.242{col 56}{space 4}-.0405019{col 69}{space 3} .1604269
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .4903249{col 28}{space 2} .0189442{col 39}{space 1}   25.88{col 48}{space 3}0.000{col 56}{space 4}  .453195{col 69}{space 3} .5274548
{txt}{space 11}cap {c |}{col 16}{res}{space 2} .0248446{col 28}{space 2} .0346191{col 39}{space 1}    0.72{col 48}{space 3}0.473{col 56}{space 4}-.0430075{col 69}{space 3} .0926968
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0575347{col 28}{space 2} .0401186{col 39}{space 1}    1.43{col 48}{space 3}0.152{col 56}{space 4}-.0210964{col 69}{space 3} .1361658
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0618813{col 28}{space 2} .0062792{col 39}{space 1}   -9.85{col 48}{space 3}0.000{col 56}{space 4}-.0741884{col 69}{space 3}-.0495743
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .4335621{col 28}{space 2} .0992369{col 39}{space 1}    4.37{col 48}{space 3}0.000{col 56}{space 4} .2390614{col 69}{space 3} .6280628
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0954294{col 28}{space 2} .1978615{col 39}{space 1}   -0.48{col 48}{space 3}0.630{col 56}{space 4}-.4832307{col 69}{space 3}  .292372
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .1954671{col 28}{space 2} .1405438{col 39}{space 1}    1.39{col 48}{space 3}0.164{col 56}{space 4}-.0799937{col 69}{space 3}  .470928
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} .4311078{col 28}{space 2} .1773039{col 39}{space 1}    2.43{col 48}{space 3}0.015{col 56}{space 4} .0835986{col 69}{space 3}  .778617
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margin,dydx(*)
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(trust), predict()}{p_end}
{p2col:dy/dx wrt:}{res:vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ 2.region 3.region 4.region}{p_end}
{p2colreset}{...}

{res}{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28} Delta-method
{col 16}{c |}      dy/dx{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2}  .077776{col 28}{space 2} .0192152{col 39}{space 1}    4.05{col 48}{space 3}0.000{col 56}{space 4} .0401149{col 69}{space 3}  .115437
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0251802{col 28}{space 2} .0012868{col 39}{space 1}  -19.57{col 48}{space 3}0.000{col 56}{space 4}-.0277022{col 69}{space 3}-.0226581
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0006199{col 28}{space 2} .0002827{col 39}{space 1}    2.19{col 48}{space 3}0.028{col 56}{space 4} .0000657{col 69}{space 3}  .001174
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.1238641{col 28}{space 2} .0178748{col 39}{space 1}   -6.93{col 48}{space 3}0.000{col 56}{space 4} -.158898{col 69}{space 3}-.0888302
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.0366362{col 28}{space 2} .0076818{col 39}{space 1}   -4.77{col 48}{space 3}0.000{col 56}{space 4}-.0516923{col 69}{space 3}-.0215802
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.0415487{col 28}{space 2} .0064063{col 39}{space 1}   -6.49{col 48}{space 3}0.000{col 56}{space 4}-.0541049{col 69}{space 3}-.0289926
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0069843{col 28}{space 2} .0014257{col 39}{space 1}   -4.90{col 48}{space 3}0.000{col 56}{space 4}-.0097787{col 69}{space 3}  -.00419
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.0491719{col 28}{space 2} .0107457{col 39}{space 1}   -4.58{col 48}{space 3}0.000{col 56}{space 4}-.0702331{col 69}{space 3}-.0281108
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0206348{col 28}{space 2} .0178132{col 39}{space 1}    1.16{col 48}{space 3}0.247{col 56}{space 4}-.0142784{col 69}{space 3}  .055548
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .1687347{col 28}{space 2} .0053281{col 39}{space 1}   31.67{col 48}{space 3}0.000{col 56}{space 4} .1582917{col 69}{space 3} .1791777
{txt}{space 11}cap {c |}{col 16}{res}{space 2} .0085497{col 28}{space 2} .0119856{col 39}{space 1}    0.71{col 48}{space 3}0.476{col 56}{space 4}-.0149416{col 69}{space 3} .0320411
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0197993{col 28}{space 2} .0136376{col 39}{space 1}    1.45{col 48}{space 3}0.147{col 56}{space 4}-.0069299{col 69}{space 3} .0465285
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0212951{col 28}{space 2} .0023294{col 39}{space 1}   -9.14{col 48}{space 3}0.000{col 56}{space 4}-.0258607{col 69}{space 3}-.0167296
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .1412986{col 28}{space 2} .0361915{col 39}{space 1}    3.90{col 48}{space 3}0.000{col 56}{space 4} .0703644{col 69}{space 3} .2122327
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0348561{col 28}{space 2} .0722118{col 39}{space 1}   -0.48{col 48}{space 3}0.629{col 56}{space 4}-.1763886{col 69}{space 3} .1066764
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .0677052{col 28}{space 2} .0495297{col 39}{space 1}    1.37{col 48}{space 3}0.172{col 56}{space 4}-.0293713{col 69}{space 3} .1647816
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 80}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6661769    .1243075   .2623401   .9378011
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,146 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,194 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,248       80.83       80.83
{txt}          1 {c |}{res}        296       19.17      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        215        6.91        6.91
{txt}          1 {c |}{res}      2,898       93.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ i.region reli health read internet tv [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3385.2614}  
Iteration 1:{space 3}log pseudolikelihood = {res:-3194.7423}  
Iteration 2:{space 3}log pseudolikelihood = {res:-3193.8509}  
Iteration 3:{space 3}log pseudolikelihood = {res:-3193.8507}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-3193.8507}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0565}

{txt}{ralign 80:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .2232531{col 28}{space 2} .0530395{col 39}{space 1}    4.21{col 48}{space 3}0.000{col 56}{space 4} .1192976{col 69}{space 3} .3272086
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0822256{col 28}{space 2} .0050927{col 39}{space 1}  -16.15{col 48}{space 3}0.000{col 56}{space 4}-.0922071{col 69}{space 3}-.0722441
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0015616{col 28}{space 2} .0014718{col 39}{space 1}    1.06{col 48}{space 3}0.289{col 56}{space 4} -.001323{col 69}{space 3} .0044462
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.3929891{col 28}{space 2} .0258528{col 39}{space 1}  -15.20{col 48}{space 3}0.000{col 56}{space 4}-.4436598{col 69}{space 3}-.3423185
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1133962{col 28}{space 2} .0141568{col 39}{space 1}   -8.01{col 48}{space 3}0.000{col 56}{space 4} -.141143{col 69}{space 3}-.0856495
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1153838{col 28}{space 2}  .024113{col 39}{space 1}   -4.79{col 48}{space 3}0.000{col 56}{space 4}-.1626444{col 69}{space 3}-.0681232
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2} -.019861{col 28}{space 2}  .004401{col 39}{space 1}   -4.51{col 48}{space 3}0.000{col 56}{space 4}-.0284869{col 69}{space 3}-.0112352
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1397253{col 28}{space 2} .0277391{col 39}{space 1}   -5.04{col 48}{space 3}0.000{col 56}{space 4}-.1940929{col 69}{space 3}-.0853577
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0603799{col 28}{space 2} .0629194{col 39}{space 1}    0.96{col 48}{space 3}0.337{col 56}{space 4}-.0629398{col 69}{space 3} .1836996
{txt}{space 8}submit {c |}{col 16}{res}{space 2}  .487341{col 28}{space 2} .0173863{col 39}{space 1}   28.03{col 48}{space 3}0.000{col 56}{space 4} .4532644{col 69}{space 3} .5214176
{txt}{space 11}cap {c |}{col 16}{res}{space 2} .0244402{col 28}{space 2} .0407475{col 39}{space 1}    0.60{col 48}{space 3}0.549{col 56}{space 4}-.0554234{col 69}{space 3} .1043038
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0573057{col 28}{space 2} .0425188{col 39}{space 1}    1.35{col 48}{space 3}0.178{col 56}{space 4}-.0260296{col 69}{space 3}  .140641
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0648796{col 28}{space 2} .0064291{col 39}{space 1}  -10.09{col 48}{space 3}0.000{col 56}{space 4}-.0774804{col 69}{space 3}-.0522787
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .4169189{col 28}{space 2} .0876234{col 39}{space 1}    4.76{col 48}{space 3}0.000{col 56}{space 4} .2451803{col 69}{space 3} .5886575
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.1062445{col 28}{space 2} .1894438{col 39}{space 1}   -0.56{col 48}{space 3}0.575{col 56}{space 4}-.4775476{col 69}{space 3} .2650585
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .1831453{col 28}{space 2} .1301118{col 39}{space 1}    1.41{col 48}{space 3}0.159{col 56}{space 4} -.071869{col 69}{space 3} .4381597
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2}-.1195141{col 28}{space 2} .0637164{col 39}{space 1}   -1.88{col 48}{space 3}0.061{col 56}{space 4} -.244396{col 69}{space 3} .0053677
{txt}{space 8}health {c |}{col 16}{res}{space 2} .0656188{col 28}{space 2} .0627466{col 39}{space 1}    1.05{col 48}{space 3}0.296{col 56}{space 4}-.0573623{col 69}{space 3}    .1886
{txt}{space 10}read {c |}{col 16}{res}{space 2} .0240317{col 28}{space 2} .0632255{col 39}{space 1}    0.38{col 48}{space 3}0.704{col 56}{space 4} -.099888{col 69}{space 3} .1479514
{txt}{space 6}internet {c |}{col 16}{res}{space 2}-.0955026{col 28}{space 2} .0475193{col 39}{space 1}   -2.01{col 48}{space 3}0.044{col 56}{space 4}-.1886387{col 69}{space 3}-.0023665
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.0698955{col 28}{space 2} .0465417{col 39}{space 1}   -1.50{col 48}{space 3}0.133{col 56}{space 4}-.1611156{col 69}{space 3} .0213247
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .5362631{col 28}{space 2} .1029979{col 39}{space 1}    5.21{col 48}{space 3}0.000{col 56}{space 4} .3343908{col 69}{space 3} .7381354
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margin,dydx(*)
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(trust), predict()}{p_end}
{p2col:dy/dx wrt:}{res:vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ 2.region 3.region 4.region reli health read internet tv}{p_end}
{p2colreset}{...}

{res}{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28} Delta-method
{col 16}{c |}      dy/dx{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .0766675{col 28}{space 2} .0176225{col 39}{space 1}    4.35{col 48}{space 3}0.000{col 56}{space 4} .0421281{col 69}{space 3} .1112068
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0282371{col 28}{space 2} .0015385{col 39}{space 1}  -18.35{col 48}{space 3}0.000{col 56}{space 4}-.0312525{col 69}{space 3}-.0252218
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0005363{col 28}{space 2} .0005096{col 39}{space 1}    1.05{col 48}{space 3}0.293{col 56}{space 4}-.0004624{col 69}{space 3}  .001535
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.1349566{col 28}{space 2} .0099303{col 39}{space 1}  -13.59{col 48}{space 3}0.000{col 56}{space 4}-.1544196{col 69}{space 3}-.1154936
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.0389415{col 28}{space 2} .0051487{col 39}{space 1}   -7.56{col 48}{space 3}0.000{col 56}{space 4}-.0490327{col 69}{space 3}-.0288503
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2} -.039624{col 28}{space 2} .0079756{col 39}{space 1}   -4.97{col 48}{space 3}0.000{col 56}{space 4}-.0552559{col 69}{space 3}-.0239922
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0068205{col 28}{space 2} .0014596{col 39}{space 1}   -4.67{col 48}{space 3}0.000{col 56}{space 4}-.0096813{col 69}{space 3}-.0039597
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.0479832{col 28}{space 2} .0098773{col 39}{space 1}   -4.86{col 48}{space 3}0.000{col 56}{space 4}-.0673424{col 69}{space 3}-.0286239
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0207351{col 28}{space 2} .0217678{col 39}{space 1}    0.95{col 48}{space 3}0.341{col 56}{space 4}-.0219289{col 69}{space 3} .0633991
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .1673581{col 28}{space 2} .0049954{col 39}{space 1}   33.50{col 48}{space 3}0.000{col 56}{space 4} .1575672{col 69}{space 3} .1771489
{txt}{space 11}cap {c |}{col 16}{res}{space 2}  .008393{col 28}{space 2} .0140581{col 39}{space 1}    0.60{col 48}{space 3}0.550{col 56}{space 4}-.0191603{col 69}{space 3} .0359464
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0196794{col 28}{space 2} .0144483{col 39}{space 1}    1.36{col 48}{space 3}0.173{col 56}{space 4}-.0086388{col 69}{space 3} .0479975
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0222803{col 28}{space 2} .0023722{col 39}{space 1}   -9.39{col 48}{space 3}0.000{col 56}{space 4}-.0269298{col 69}{space 3}-.0176308
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .1355339{col 28}{space 2} .0321862{col 39}{space 1}    4.21{col 48}{space 3}0.000{col 56}{space 4} .0724501{col 69}{space 3} .1986178
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0386648{col 28}{space 2} .0689037{col 39}{space 1}   -0.56{col 48}{space 3}0.575{col 56}{space 4}-.1737136{col 69}{space 3}  .096384
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .0632072{col 28}{space 2}  .045682{col 39}{space 1}    1.38{col 48}{space 3}0.166{col 56}{space 4}-.0263279{col 69}{space 3} .1527423
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2}-.0410424{col 28}{space 2} .0215609{col 39}{space 1}   -1.90{col 48}{space 3}0.057{col 56}{space 4}-.0833009{col 69}{space 3} .0012161
{txt}{space 8}health {c |}{col 16}{res}{space 2} .0225342{col 28}{space 2} .0217237{col 39}{space 1}    1.04{col 48}{space 3}0.300{col 56}{space 4}-.0200434{col 69}{space 3} .0651118
{txt}{space 10}read {c |}{col 16}{res}{space 2} .0082527{col 28}{space 2} .0216479{col 39}{space 1}    0.38{col 48}{space 3}0.703{col 56}{space 4}-.0341764{col 69}{space 3} .0506819
{txt}{space 6}internet {c |}{col 16}{res}{space 2}-.0327966{col 28}{space 2}  .016073{col 39}{space 1}   -2.04{col 48}{space 3}0.041{col 56}{space 4} -.064299{col 69}{space 3}-.0012942
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.0240028{col 28}{space 2}   .01617{col 39}{space 1}   -1.48{col 48}{space 3}0.138{col 56}{space 4}-.0556955{col 69}{space 3} .0076898
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 80}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6667806    .1260128   .2459062   .9516883
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,150 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,198 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,248       80.83       80.83
{txt}          1 {c |}{res}        296       19.17      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        211        6.78        6.78
{txt}          1 {c |}{res}      2,902       93.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote vote_male male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ i.region reli health read internet tv [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3385.2614}  
Iteration 1:{space 3}log pseudolikelihood = {res:-3194.0727}  
Iteration 2:{space 3}log pseudolikelihood = {res:-3193.1988}  
Iteration 3:{space 3}log pseudolikelihood = {res:-3193.1987}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-3193.1987}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0567}

{txt}{ralign 80:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .1800648{col 28}{space 2}  .068763{col 39}{space 1}    2.62{col 48}{space 3}0.009{col 56}{space 4} .0452918{col 69}{space 3} .3148378
{txt}{space 5}vote_male {c |}{col 16}{res}{space 2} .0874631{col 28}{space 2} .0314143{col 39}{space 1}    2.78{col 48}{space 3}0.005{col 56}{space 4} .0258921{col 69}{space 3}  .149034
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.1374491{col 28}{space 2} .0138781{col 39}{space 1}   -9.90{col 48}{space 3}0.000{col 56}{space 4}-.1646497{col 69}{space 3}-.1102485
{txt}{space 11}age {c |}{col 16}{res}{space 2}  .001556{col 28}{space 2} .0014597{col 39}{space 1}    1.07{col 48}{space 3}0.286{col 56}{space 4}-.0013049{col 69}{space 3} .0044169
{txt}{space 11}Han {c |}{col 16}{res}{space 2} -.393123{col 28}{space 2} .0256389{col 39}{space 1}  -15.33{col 48}{space 3}0.000{col 56}{space 4}-.4433742{col 69}{space 3}-.3428717
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1140791{col 28}{space 2} .0144865{col 39}{space 1}   -7.87{col 48}{space 3}0.000{col 56}{space 4} -.142472{col 69}{space 3}-.0856861
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1139262{col 28}{space 2} .0242401{col 39}{space 1}   -4.70{col 48}{space 3}0.000{col 56}{space 4}-.1614359{col 69}{space 3}-.0664165
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0197528{col 28}{space 2} .0043237{col 39}{space 1}   -4.57{col 48}{space 3}0.000{col 56}{space 4}-.0282272{col 69}{space 3}-.0112785
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1389842{col 28}{space 2} .0271117{col 39}{space 1}   -5.13{col 48}{space 3}0.000{col 56}{space 4}-.1921222{col 69}{space 3}-.0858462
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0542732{col 28}{space 2} .0607942{col 39}{space 1}    0.89{col 48}{space 3}0.372{col 56}{space 4}-.0648812{col 69}{space 3} .1734276
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .4881609{col 28}{space 2} .0170146{col 39}{space 1}   28.69{col 48}{space 3}0.000{col 56}{space 4} .4548128{col 69}{space 3} .5215089
{txt}{space 11}cap {c |}{col 16}{res}{space 2} .0236517{col 28}{space 2} .0397292{col 39}{space 1}    0.60{col 48}{space 3}0.552{col 56}{space 4}-.0542161{col 69}{space 3} .1015196
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0577956{col 28}{space 2} .0420218{col 39}{space 1}    1.38{col 48}{space 3}0.169{col 56}{space 4}-.0245656{col 69}{space 3} .1401569
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0653686{col 28}{space 2} .0072029{col 39}{space 1}   -9.08{col 48}{space 3}0.000{col 56}{space 4}-.0794859{col 69}{space 3}-.0512513
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .4161797{col 28}{space 2} .0885459{col 39}{space 1}    4.70{col 48}{space 3}0.000{col 56}{space 4} .2426329{col 69}{space 3} .5897265
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.1072535{col 28}{space 2} .1896896{col 39}{space 1}   -0.57{col 48}{space 3}0.572{col 56}{space 4}-.4790382{col 69}{space 3} .2645312
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .1829603{col 28}{space 2} .1306896{col 39}{space 1}    1.40{col 48}{space 3}0.162{col 56}{space 4}-.0731867{col 69}{space 3} .4391073
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2}-.1209203{col 28}{space 2}  .063806{col 39}{space 1}   -1.90{col 48}{space 3}0.058{col 56}{space 4}-.2459779{col 69}{space 3} .0041372
{txt}{space 8}health {c |}{col 16}{res}{space 2} .0656003{col 28}{space 2} .0629908{col 39}{space 1}    1.04{col 48}{space 3}0.298{col 56}{space 4}-.0578595{col 69}{space 3} .1890601
{txt}{space 10}read {c |}{col 16}{res}{space 2} .0237463{col 28}{space 2} .0649659{col 39}{space 1}    0.37{col 48}{space 3}0.715{col 56}{space 4}-.1035845{col 69}{space 3}  .151077
{txt}{space 6}internet {c |}{col 16}{res}{space 2}-.0933829{col 28}{space 2} .0494385{col 39}{space 1}   -1.89{col 48}{space 3}0.059{col 56}{space 4}-.1902805{col 69}{space 3} .0035148
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.0694107{col 28}{space 2} .0460535{col 39}{space 1}   -1.51{col 48}{space 3}0.132{col 56}{space 4}-.1596739{col 69}{space 3} .0208524
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .5600467{col 28}{space 2} .1121665{col 39}{space 1}    4.99{col 48}{space 3}0.000{col 56}{space 4} .3402044{col 69}{space 3} .7798889
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***F test
. test vote_male + vote=0

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[trust]vote + [trust]vote_male = 0{p_end}

{txt}{col 12}chi2(  1) ={res}   50.88
{txt}{col 10}Prob > chi2 =  {res}  0.0000
{txt}
{com}. ***margin
. margin,dydx(*)
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(trust), predict()}{p_end}
{p2col:dy/dx wrt:}{res:vote vote_male male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ 2.region 3.region 4.region reli health read internet tv}{p_end}
{p2colreset}{...}

{res}{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28} Delta-method
{col 16}{c |}      dy/dx{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .0618212{col 28}{space 2} .0231324{col 39}{space 1}    2.67{col 48}{space 3}0.008{col 56}{space 4} .0164825{col 69}{space 3}   .10716
{txt}{space 5}vote_male {c |}{col 16}{res}{space 2} .0300285{col 28}{space 2}  .011018{col 39}{space 1}    2.73{col 48}{space 3}0.006{col 56}{space 4} .0084336{col 69}{space 3} .0516234
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0471901{col 28}{space 2} .0051305{col 39}{space 1}   -9.20{col 48}{space 3}0.000{col 56}{space 4}-.0572458{col 69}{space 3}-.0371344
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0005342{col 28}{space 2} .0005052{col 39}{space 1}    1.06{col 48}{space 3}0.290{col 56}{space 4}-.0004561{col 69}{space 3} .0015245
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.1349701{col 28}{space 2}  .009848{col 39}{space 1}  -13.71{col 48}{space 3}0.000{col 56}{space 4}-.1542717{col 69}{space 3}-.1156684
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.0391665{col 28}{space 2} .0052605{col 39}{space 1}   -7.45{col 48}{space 3}0.000{col 56}{space 4}-.0494769{col 69}{space 3}-.0288561
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2} -.039114{col 28}{space 2} .0080233{col 39}{space 1}   -4.88{col 48}{space 3}0.000{col 56}{space 4}-.0548395{col 69}{space 3}-.0233886
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0067817{col 28}{space 2} .0014334{col 39}{space 1}   -4.73{col 48}{space 3}0.000{col 56}{space 4}-.0095912{col 69}{space 3}-.0039722
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.0477171{col 28}{space 2} .0096546{col 39}{space 1}   -4.94{col 48}{space 3}0.000{col 56}{space 4}-.0666398{col 69}{space 3}-.0287945
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0186335{col 28}{space 2} .0210156{col 39}{space 1}    0.89{col 48}{space 3}0.375{col 56}{space 4}-.0225563{col 69}{space 3} .0598233
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .1675992{col 28}{space 2} .0048913{col 39}{space 1}   34.26{col 48}{space 3}0.000{col 56}{space 4} .1580125{col 69}{space 3}  .177186
{txt}{space 11}cap {c |}{col 16}{res}{space 2} .0081203{col 28}{space 2} .0137026{col 39}{space 1}    0.59{col 48}{space 3}0.553{col 56}{space 4}-.0187362{col 69}{space 3} .0349768
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0198428{col 28}{space 2} .0142739{col 39}{space 1}    1.39{col 48}{space 3}0.164{col 56}{space 4}-.0081334{col 69}{space 3} .0478191
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0224429{col 28}{space 2} .0026398{col 39}{space 1}   -8.50{col 48}{space 3}0.000{col 56}{space 4}-.0276168{col 69}{space 3}-.0172689
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .1352549{col 28}{space 2} .0324776{col 39}{space 1}    4.16{col 48}{space 3}0.000{col 56}{space 4} .0715999{col 69}{space 3} .1989098
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0390249{col 28}{space 2} .0689726{col 39}{space 1}   -0.57{col 48}{space 3}0.572{col 56}{space 4}-.1742088{col 69}{space 3}  .096159
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .0631189{col 28}{space 2}  .045873{col 39}{space 1}    1.38{col 48}{space 3}0.169{col 56}{space 4}-.0267905{col 69}{space 3} .1530283
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2}-.0415153{col 28}{space 2} .0215848{col 39}{space 1}   -1.92{col 48}{space 3}0.054{col 56}{space 4}-.0838207{col 69}{space 3}   .00079
{txt}{space 8}health {c |}{col 16}{res}{space 2} .0225224{col 28}{space 2} .0218011{col 39}{space 1}    1.03{col 48}{space 3}0.302{col 56}{space 4} -.020207{col 69}{space 3} .0652518
{txt}{space 10}read {c |}{col 16}{res}{space 2} .0081528{col 28}{space 2} .0222414{col 39}{space 1}    0.37{col 48}{space 3}0.714{col 56}{space 4}-.0354396{col 69}{space 3} .0517451
{txt}{space 6}internet {c |}{col 16}{res}{space 2}-.0320609{col 28}{space 2} .0167346{col 39}{space 1}   -1.92{col 48}{space 3}0.055{col 56}{space 4}-.0648601{col 69}{space 3} .0007382
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.0238306{col 28}{space 2} .0159959{col 39}{space 1}   -1.49{col 48}{space 3}0.136{col 56}{space 4}-.0551821{col 69}{space 3} .0075208
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 80}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. ***再测一次f-test
. test vote_male + vote =0

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[trust]vote + [trust]vote_male = 0{p_end}

{txt}{col 12}chi2(  1) ={res}   50.88
{txt}{col 10}Prob > chi2 =  {res}  0.0000
{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6666804    .1261884   .2359179   .9494804
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,129 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,193 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,240       80.31       80.31
{txt}          1 {c |}{res}        304       19.69      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        224        7.20        7.20
{txt}          1 {c |}{res}      2,889       92.80      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote vote_party male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ i.region reli health read internet tv [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3385.2614}  
Iteration 1:{space 3}log pseudolikelihood = {res: -3194.571}  
Iteration 2:{space 3}log pseudolikelihood = {res:-3193.6773}  
Iteration 3:{space 3}log pseudolikelihood = {res:-3193.6771}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-3193.6771}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0566}

{txt}{ralign 80:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .2273326{col 28}{space 2} .0492573{col 39}{space 1}    4.62{col 48}{space 3}0.000{col 56}{space 4}   .13079{col 69}{space 3} .3238752
{txt}{space 4}vote_party {c |}{col 16}{res}{space 2}-.1272044{col 28}{space 2} .1269046{col 39}{space 1}   -1.00{col 48}{space 3}0.316{col 56}{space 4}-.3759328{col 69}{space 3}  .121524
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0821813{col 28}{space 2} .0050099{col 39}{space 1}  -16.40{col 48}{space 3}0.000{col 56}{space 4}-.0920005{col 69}{space 3}-.0723622
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0015557{col 28}{space 2} .0014738{col 39}{space 1}    1.06{col 48}{space 3}0.291{col 56}{space 4} -.001333{col 69}{space 3} .0044444
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.3920616{col 28}{space 2} .0247023{col 39}{space 1}  -15.87{col 48}{space 3}0.000{col 56}{space 4}-.4404773{col 69}{space 3}-.3436459
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1135136{col 28}{space 2} .0147126{col 39}{space 1}   -7.72{col 48}{space 3}0.000{col 56}{space 4}-.1423499{col 69}{space 3}-.0846774
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2} -.115368{col 28}{space 2} .0240367{col 39}{space 1}   -4.80{col 48}{space 3}0.000{col 56}{space 4}-.1624791{col 69}{space 3}-.0682569
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0198727{col 28}{space 2} .0044973{col 39}{space 1}   -4.42{col 48}{space 3}0.000{col 56}{space 4}-.0286872{col 69}{space 3}-.0110582
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1401648{col 28}{space 2} .0281851{col 39}{space 1}   -4.97{col 48}{space 3}0.000{col 56}{space 4}-.1954066{col 69}{space 3}-.0849231
{txt}{space 9}party {c |}{col 16}{res}{space 2} .1654614{col 28}{space 2} .1689499{col 39}{space 1}    0.98{col 48}{space 3}0.327{col 56}{space 4}-.1656744{col 69}{space 3} .4965972
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .4873739{col 28}{space 2}  .017539{col 39}{space 1}   27.79{col 48}{space 3}0.000{col 56}{space 4} .4529982{col 69}{space 3} .5217497
{txt}{space 11}cap {c |}{col 16}{res}{space 2} .0251518{col 28}{space 2}  .041848{col 39}{space 1}    0.60{col 48}{space 3}0.548{col 56}{space 4}-.0568689{col 69}{space 3} .1071724
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0578615{col 28}{space 2} .0419005{col 39}{space 1}    1.38{col 48}{space 3}0.167{col 56}{space 4} -.024262{col 69}{space 3} .1399851
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0650928{col 28}{space 2} .0065369{col 39}{space 1}   -9.96{col 48}{space 3}0.000{col 56}{space 4}-.0779049{col 69}{space 3}-.0522807
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .4162002{col 28}{space 2} .0888416{col 39}{space 1}    4.68{col 48}{space 3}0.000{col 56}{space 4} .2420739{col 69}{space 3} .5903265
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.1065033{col 28}{space 2} .1904418{col 39}{space 1}   -0.56{col 48}{space 3}0.576{col 56}{space 4}-.4797624{col 69}{space 3} .2667557
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .1828112{col 28}{space 2} .1309131{col 39}{space 1}    1.40{col 48}{space 3}0.163{col 56}{space 4}-.0737737{col 69}{space 3} .4393962
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2}-.1194821{col 28}{space 2} .0642511{col 39}{space 1}   -1.86{col 48}{space 3}0.063{col 56}{space 4} -.245412{col 69}{space 3} .0064477
{txt}{space 8}health {c |}{col 16}{res}{space 2} .0653898{col 28}{space 2}   .06256{col 39}{space 1}    1.05{col 48}{space 3}0.296{col 56}{space 4}-.0572256{col 69}{space 3} .1880051
{txt}{space 10}read {c |}{col 16}{res}{space 2} .0245086{col 28}{space 2} .0629357{col 39}{space 1}    0.39{col 48}{space 3}0.697{col 56}{space 4}-.0988431{col 69}{space 3} .1478603
{txt}{space 6}internet {c |}{col 16}{res}{space 2}-.0959967{col 28}{space 2} .0469689{col 39}{space 1}   -2.04{col 48}{space 3}0.041{col 56}{space 4} -.188054{col 69}{space 3}-.0039393
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.0695463{col 28}{space 2} .0460417{col 39}{space 1}   -1.51{col 48}{space 3}0.131{col 56}{space 4}-.1597864{col 69}{space 3} .0206939
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .5332076{col 28}{space 2} .0995921{col 39}{space 1}    5.35{col 48}{space 3}0.000{col 56}{space 4} .3380107{col 69}{space 3} .7284045
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***F test
. test vote_party + vote=0

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[trust]vote + [trust]vote_party = 0{p_end}

{txt}{col 12}chi2(  1) ={res}    0.33
{txt}{col 10}Prob > chi2 =  {res}  0.5686
{txt}
{com}. ***margin
. margin,dydx(*)
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(trust), predict()}{p_end}
{p2col:dy/dx wrt:}{res:vote vote_party male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ 2.region 3.region 4.region reli health read internet tv}{p_end}
{p2colreset}{...}

{res}{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28} Delta-method
{col 16}{c |}      dy/dx{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2}  .078064{col 28}{space 2} .0163215{col 39}{space 1}    4.78{col 48}{space 3}0.000{col 56}{space 4} .0460743{col 69}{space 3} .1100536
{txt}{space 4}vote_party {c |}{col 16}{res}{space 2}-.0436808{col 28}{space 2}  .043914{col 39}{space 1}   -0.99{col 48}{space 3}0.320{col 56}{space 4}-.1297508{col 69}{space 3} .0423891
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0282203{col 28}{space 2} .0015129{col 39}{space 1}  -18.65{col 48}{space 3}0.000{col 56}{space 4}-.0311856{col 69}{space 3} -.025255
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0005342{col 28}{space 2} .0005102{col 39}{space 1}    1.05{col 48}{space 3}0.295{col 56}{space 4}-.0004657{col 69}{space 3} .0015341
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.1346304{col 28}{space 2} .0095173{col 39}{space 1}  -14.15{col 48}{space 3}0.000{col 56}{space 4}-.1532841{col 69}{space 3}-.1159768
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.0389796{col 28}{space 2} .0053366{col 39}{space 1}   -7.30{col 48}{space 3}0.000{col 56}{space 4}-.0494391{col 69}{space 3}  -.02852
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.0396163{col 28}{space 2} .0079533{col 39}{space 1}   -4.98{col 48}{space 3}0.000{col 56}{space 4}-.0552045{col 69}{space 3}-.0240282
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0068241{col 28}{space 2} .0014932{col 39}{space 1}   -4.57{col 48}{space 3}0.000{col 56}{space 4}-.0097508{col 69}{space 3}-.0038975
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.0481313{col 28}{space 2} .0100268{col 39}{space 1}   -4.80{col 48}{space 3}0.000{col 56}{space 4}-.0677834{col 69}{space 3}-.0284792
{txt}{space 9}party {c |}{col 16}{res}{space 2}  .056818{col 28}{space 2} .0584525{col 39}{space 1}    0.97{col 48}{space 3}0.331{col 56}{space 4}-.0577468{col 69}{space 3} .1713827
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .1673598{col 28}{space 2} .0050546{col 39}{space 1}   33.11{col 48}{space 3}0.000{col 56}{space 4}  .157453{col 69}{space 3} .1772667
{txt}{space 11}cap {c |}{col 16}{res}{space 2} .0086369{col 28}{space 2} .0144362{col 39}{space 1}    0.60{col 48}{space 3}0.550{col 56}{space 4}-.0196575{col 69}{space 3} .0369313
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0198691{col 28}{space 2} .0142359{col 39}{space 1}    1.40{col 48}{space 3}0.163{col 56}{space 4}-.0080327{col 69}{space 3} .0477709
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0223523{col 28}{space 2} .0024077{col 39}{space 1}   -9.28{col 48}{space 3}0.000{col 56}{space 4}-.0270714{col 69}{space 3}-.0176332
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .1352997{col 28}{space 2} .0325968{col 39}{space 1}    4.15{col 48}{space 3}0.000{col 56}{space 4} .0714112{col 69}{space 3} .1991883
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0387545{col 28}{space 2} .0692513{col 39}{space 1}   -0.56{col 48}{space 3}0.576{col 56}{space 4}-.1744846{col 69}{space 3} .0969756
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .0630849{col 28}{space 2} .0459683{col 39}{space 1}    1.37{col 48}{space 3}0.170{col 56}{space 4}-.0270112{col 69}{space 3}  .153181
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2}-.0410291{col 28}{space 2} .0217478{col 39}{space 1}   -1.89{col 48}{space 3}0.059{col 56}{space 4} -.083654{col 69}{space 3} .0015958
{txt}{space 8}health {c |}{col 16}{res}{space 2} .0224543{col 28}{space 2} .0216553{col 39}{space 1}    1.04{col 48}{space 3}0.300{col 56}{space 4}-.0199893{col 69}{space 3} .0648978
{txt}{space 10}read {c |}{col 16}{res}{space 2}  .008416{col 28}{space 2} .0215468{col 39}{space 1}    0.39{col 48}{space 3}0.696{col 56}{space 4} -.033815{col 69}{space 3}  .050647
{txt}{space 6}internet {c |}{col 16}{res}{space 2}-.0329644{col 28}{space 2} .0158855{col 39}{space 1}   -2.08{col 48}{space 3}0.038{col 56}{space 4}-.0640995{col 69}{space 3}-.0018293
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.0238816{col 28}{space 2} .0159938{col 39}{space 1}   -1.49{col 48}{space 3}0.135{col 56}{space 4}-.0552289{col 69}{space 3} .0074658
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 80}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. ***再测一次f-test
. test vote_party + vote=0

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[trust]vote + [trust]vote_party = 0{p_end}

{txt}{col 12}chi2(  1) ={res}    0.33
{txt}{col 10}Prob > chi2 =  {res}  0.5686
{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6668141    .1260929   .2452344   .9517049
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,147 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,199 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,246       80.70       80.70
{txt}          1 {c |}{res}        298       19.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        212        6.81        6.81
{txt}          1 {c |}{res}      2,901       93.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. *Appendix A
. oprobit level i.vote [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-7562.2895}  
Iteration 1:{space 3}log pseudolikelihood = {res:-7527.2707}  
Iteration 2:{space 3}log pseudolikelihood = {res:  -7527.27}  
{res}
{txt}{col 1}Ordered probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(0)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 8:-7527.27}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0046}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       level{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}
{space 8}Yes  {c |}{col 14}{res}{space 2} .2570853{col 26}{space 2} .0179764{col 37}{space 1}   14.30{col 46}{space 3}0.000{col 54}{space 4} .2218522{col 67}{space 3} .2923183
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/cut1 {c |}{col 14}{res}{space 2}-1.470047{col 26}{space 2} .0263207{col 54}{space 4}-1.521635{col 67}{space 3} -1.41846
{txt}{space 7}/cut2 {c |}{col 14}{res}{space 2}-.7677367{col 26}{space 2} .0139488{col 54}{space 4}-.7950758{col 67}{space 3}-.7403977
{txt}{space 7}/cut3 {c |}{col 14}{res}{space 2}-.2534506{col 26}{space 2} .0265289{col 54}{space 4}-.3054462{col 67}{space 3} -.201455
{txt}{space 7}/cut4 {c |}{col 14}{res}{space 2} .7809248{col 26}{space 2} .0627587{col 54}{space 4} .6579202{col 67}{space 3} .9039295
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, dydx(vote) 
{res}
{txt}{col 1}Conditional marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 12 12 2}{...}
{p2col:dy/dx wrt:}{res:1.vote}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 13 13 2}{...}
{p2col:{txt:1._predict:}}{res:Pr(level==1), predict(pr outcome(1))}{p_end}
{p2col:{txt:2._predict:}}{res:Pr(level==2), predict(pr outcome(2))}{p_end}
{p2col:{txt:3._predict:}}{res:Pr(level==3), predict(pr outcome(3))}{p_end}
{p2col:{txt:4._predict:}}{res:Pr(level==4), predict(pr outcome(4))}{p_end}
{p2col:{txt:5._predict:}}{res:Pr(level==5), predict(pr outcome(5))}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0.vote      {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1.vote       {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0287025{col 26}{space 2} .0007436{col 37}{space 1}  -38.60{col 46}{space 3}0.000{col 54}{space 4}-.0301601{col 67}{space 3} -.027245
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0398957{col 26}{space 2} .0030089{col 37}{space 1}  -13.26{col 46}{space 3}0.000{col 54}{space 4} -.045793{col 67}{space 3}-.0339983
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0265238{col 26}{space 2} .0018793{col 37}{space 1}  -14.11{col 46}{space 3}0.000{col 54}{space 4}-.0302072{col 67}{space 3}-.0228403
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0123503{col 26}{space 2} .0042869{col 37}{space 1}    2.88{col 46}{space 3}0.004{col 54}{space 4} .0039481{col 67}{space 3} .0207524
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0827717{col 26}{space 2} .0094925{col 37}{space 1}    8.72{col 46}{space 3}0.000{col 54}{space 4} .0641668{col 67}{space 3} .1013766
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 78}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. oprobit level i.vote male age Han mar prim_scho [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-7562.2895}  
Iteration 1:{space 3}log pseudolikelihood = {res:-7443.8832}  
Iteration 2:{space 3}log pseudolikelihood = {res:-7443.8592}  
Iteration 3:{space 3}log pseudolikelihood = {res:-7443.8592}  
{res}
{txt}{col 1}Ordered probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(0)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-7443.8592}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0157}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       level{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}
{space 8}Yes  {c |}{col 14}{res}{space 2} .2584665{col 26}{space 2} .0255068{col 37}{space 1}   10.13{col 46}{space 3}0.000{col 54}{space 4} .2084741{col 67}{space 3} .3084589
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1027428{col 26}{space 2} .0186686{col 37}{space 1}   -5.50{col 46}{space 3}0.000{col 54}{space 4}-.1393326{col 67}{space 3}-.0661529
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0036827{col 26}{space 2}  .000854{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0020088{col 67}{space 3} .0053565
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.3487118{col 26}{space 2} .0496927{col 37}{space 1}   -7.02{col 46}{space 3}0.000{col 54}{space 4}-.4461076{col 67}{space 3} -.251316
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.1182651{col 26}{space 2} .0078875{col 37}{space 1}  -14.99{col 46}{space 3}0.000{col 54}{space 4}-.1337243{col 67}{space 3}-.1028059
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}-.1986185{col 26}{space 2} .0246822{col 37}{space 1}   -8.05{col 46}{space 3}0.000{col 54}{space 4}-.2469948{col 67}{space 3}-.1502422
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}/cut1 {c |}{col 14}{res}{space 2}-1.869318{col 26}{space 2} .0308056{col 54}{space 4}-1.929696{col 67}{space 3}-1.808941
{txt}{space 7}/cut2 {c |}{col 14}{res}{space 2}-1.158268{col 26}{space 2} .0156889{col 54}{space 4}-1.189018{col 67}{space 3}-1.127518
{txt}{space 7}/cut3 {c |}{col 14}{res}{space 2}-.6370587{col 26}{space 2} .0275931{col 54}{space 4}-.6911402{col 67}{space 3}-.5829772
{txt}{space 7}/cut4 {c |}{col 14}{res}{space 2} .4178435{col 26}{space 2} .0640627{col 54}{space 4} .2922829{col 67}{space 3} .5434042
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, dydx(vote) 
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 12 12 2}{...}
{p2col:dy/dx wrt:}{res:1.vote}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 13 13 2}{...}
{p2col:{txt:1._predict:}}{res:Pr(level==1), predict(pr outcome(1))}{p_end}
{p2col:{txt:2._predict:}}{res:Pr(level==2), predict(pr outcome(2))}{p_end}
{p2col:{txt:3._predict:}}{res:Pr(level==3), predict(pr outcome(3))}{p_end}
{p2col:{txt:4._predict:}}{res:Pr(level==4), predict(pr outcome(4))}{p_end}
{p2col:{txt:5._predict:}}{res:Pr(level==5), predict(pr outcome(5))}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0.vote      {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1.vote       {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0285097{col 26}{space 2} .0033522{col 37}{space 1}   -8.50{col 46}{space 3}0.000{col 54}{space 4}-.0350799{col 67}{space 3}-.0219395
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0392792{col 26}{space 2} .0016143{col 37}{space 1}  -24.33{col 46}{space 3}0.000{col 54}{space 4}-.0424432{col 67}{space 3}-.0361152
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0261005{col 26}{space 2} .0012771{col 37}{space 1}  -20.44{col 46}{space 3}0.000{col 54}{space 4}-.0286035{col 67}{space 3}-.0235975
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0121781{col 26}{space 2} .0019879{col 37}{space 1}    6.13{col 46}{space 3}0.000{col 54}{space 4} .0082818{col 67}{space 3} .0160744
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0817113{col 26}{space 2} .0014366{col 37}{space 1}   56.88{col 46}{space 3}0.000{col 54}{space 4} .0788957{col 67}{space 3}  .084527
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 78}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. oprobit level i.vote male age Han mar prim_scho lg_inc_imputed below_aver [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-7562.2895}  
Iteration 1:{space 3}log pseudolikelihood = {res:-7440.3187}  
Iteration 2:{space 3}log pseudolikelihood = {res:-7440.2936}  
Iteration 3:{space 3}log pseudolikelihood = {res:-7440.2936}  
{res}
{txt}{col 1}Ordered probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(0)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-7440.2936}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0161}

{txt}{ralign 80:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         level{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}
{space 10}Yes  {c |}{col 16}{res}{space 2} .2543225{col 28}{space 2}  .026418{col 39}{space 1}    9.63{col 48}{space 3}0.000{col 56}{space 4} .2025442{col 69}{space 3} .3061009
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0865982{col 28}{space 2} .0234455{col 39}{space 1}   -3.69{col 48}{space 3}0.000{col 56}{space 4}-.1325506{col 69}{space 3}-.0406458
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0034478{col 28}{space 2} .0007607{col 39}{space 1}    4.53{col 48}{space 3}0.000{col 56}{space 4} .0019569{col 69}{space 3} .0049387
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.3458291{col 28}{space 2}  .048691{col 39}{space 1}   -7.10{col 48}{space 3}0.000{col 56}{space 4}-.4412616{col 69}{space 3}-.2503966
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1115325{col 28}{space 2} .0093422{col 39}{space 1}  -11.94{col 48}{space 3}0.000{col 56}{space 4}-.1298429{col 69}{space 3} -.093222
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2} -.204938{col 28}{space 2} .0207299{col 39}{space 1}   -9.89{col 48}{space 3}0.000{col 56}{space 4}-.2455678{col 69}{space 3}-.1643082
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0082712{col 28}{space 2} .0020489{col 39}{space 1}   -4.04{col 48}{space 3}0.000{col 56}{space 4}-.0122869{col 69}{space 3}-.0042554
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.0739317{col 28}{space 2} .0270989{col 39}{space 1}   -2.73{col 48}{space 3}0.006{col 56}{space 4}-.1270447{col 69}{space 3}-.0208188
{txt}{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}/cut1 {c |}{col 16}{res}{space 2}-1.966525{col 28}{space 2} .0028161{col 56}{space 4}-1.972044{col 69}{space 3}-1.961005
{txt}{space 9}/cut2 {c |}{col 16}{res}{space 2}-1.253463{col 28}{space 2} .0136972{col 56}{space 4}-1.280309{col 69}{space 3}-1.226617
{txt}{space 9}/cut3 {c |}{col 16}{res}{space 2}-.7313092{col 28}{space 2} .0034814{col 56}{space 4}-.7381327{col 69}{space 3}-.7244857
{txt}{space 9}/cut4 {c |}{col 16}{res}{space 2}  .323779{col 28}{space 2} .0357116{col 56}{space 4} .2537855{col 69}{space 3} .3937725
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, dydx(vote) 
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 12 12 2}{...}
{p2col:dy/dx wrt:}{res:1.vote}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 13 13 2}{...}
{p2col:{txt:1._predict:}}{res:Pr(level==1), predict(pr outcome(1))}{p_end}
{p2col:{txt:2._predict:}}{res:Pr(level==2), predict(pr outcome(2))}{p_end}
{p2col:{txt:3._predict:}}{res:Pr(level==3), predict(pr outcome(3))}{p_end}
{p2col:{txt:4._predict:}}{res:Pr(level==4), predict(pr outcome(4))}{p_end}
{p2col:{txt:5._predict:}}{res:Pr(level==5), predict(pr outcome(5))}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0.vote      {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1.vote       {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0279429{col 26}{space 2} .0022154{col 37}{space 1}  -12.61{col 46}{space 3}0.000{col 54}{space 4} -.032285{col 67}{space 3}-.0236008
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0386848{col 26}{space 2} .0021072{col 37}{space 1}  -18.36{col 46}{space 3}0.000{col 54}{space 4}-.0428149{col 67}{space 3}-.0345547
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0256975{col 26}{space 2} .0005287{col 37}{space 1}  -48.61{col 46}{space 3}0.000{col 54}{space 4}-.0267336{col 67}{space 3}-.0246613
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0119569{col 26}{space 2} .0005833{col 37}{space 1}   20.50{col 46}{space 3}0.000{col 54}{space 4} .0108136{col 67}{space 3} .0131001
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0803683{col 26}{space 2}  .000178{col 37}{space 1}  451.43{col 46}{space 3}0.000{col 54}{space 4} .0800194{col 67}{space 3} .0807173
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 78}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. oprobit level i.vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-7562.2895}  
Iteration 1:{space 3}log pseudolikelihood = {res:  -7370.69}  
Iteration 2:{space 3}log pseudolikelihood = {res:-7370.6274}  
Iteration 3:{space 3}log pseudolikelihood = {res:-7370.6274}  
{res}
{txt}{col 1}Ordered probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(0)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-7370.6274}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0253}

{txt}{ralign 80:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         level{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}
{space 10}Yes  {c |}{col 16}{res}{space 2}   .24136{col 28}{space 2} .0248094{col 39}{space 1}    9.73{col 48}{space 3}0.000{col 56}{space 4} .1927345{col 69}{space 3} .2899855
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0783967{col 28}{space 2} .0255934{col 39}{space 1}   -3.06{col 48}{space 3}0.002{col 56}{space 4}-.1285589{col 69}{space 3}-.0282344
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0023391{col 28}{space 2} .0004032{col 39}{space 1}    5.80{col 48}{space 3}0.000{col 56}{space 4} .0015488{col 69}{space 3} .0031295
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.3476931{col 28}{space 2} .0415729{col 39}{space 1}   -8.36{col 48}{space 3}0.000{col 56}{space 4}-.4291745{col 69}{space 3}-.2662116
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1142589{col 28}{space 2} .0035341{col 39}{space 1}  -32.33{col 48}{space 3}0.000{col 56}{space 4}-.1211857{col 69}{space 3}-.1073322
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1808989{col 28}{space 2} .0214622{col 39}{space 1}   -8.43{col 48}{space 3}0.000{col 56}{space 4}-.2229641{col 69}{space 3}-.1388337
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0112503{col 28}{space 2} .0018259{col 39}{space 1}   -6.16{col 48}{space 3}0.000{col 56}{space 4} -.014829{col 69}{space 3}-.0076716
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2} -.084623{col 28}{space 2} .0283222{col 39}{space 1}   -2.99{col 48}{space 3}0.003{col 56}{space 4}-.1401334{col 69}{space 3}-.0291125
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0518256{col 28}{space 2} .0378612{col 39}{space 1}    1.37{col 48}{space 3}0.171{col 56}{space 4}-.0223809{col 69}{space 3} .1260322
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .4447056{col 28}{space 2} .0177532{col 39}{space 1}   25.05{col 48}{space 3}0.000{col 56}{space 4} .4099099{col 69}{space 3} .4795013
{txt}{space 11}cap {c |}{col 16}{res}{space 2}-.0045903{col 28}{space 2} .0198138{col 39}{space 1}   -0.23{col 48}{space 3}0.817{col 56}{space 4}-.0434247{col 69}{space 3}  .034244
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0629536{col 28}{space 2} .0138352{col 39}{space 1}    4.55{col 48}{space 3}0.000{col 56}{space 4} .0358371{col 69}{space 3} .0900702
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0517053{col 28}{space 2} .0202327{col 39}{space 1}   -2.56{col 48}{space 3}0.011{col 56}{space 4}-.0913606{col 69}{space 3}-.0120499
{txt}{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}/cut1 {c |}{col 16}{res}{space 2}-1.687984{col 28}{space 2} .0267415{col 56}{space 4}-1.740396{col 69}{space 3}-1.635571
{txt}{space 9}/cut2 {c |}{col 16}{res}{space 2}-.9690466{col 28}{space 2}  .040444{col 56}{space 4}-1.048315{col 69}{space 3}-.8897777
{txt}{space 9}/cut3 {c |}{col 16}{res}{space 2}-.4391766{col 28}{space 2}  .028441{col 56}{space 4}-.4949199{col 69}{space 3}-.3834333
{txt}{space 9}/cut4 {c |}{col 16}{res}{space 2} .6348032{col 28}{space 2}  .011983{col 56}{space 4} .6113168{col 69}{space 3} .6582895
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, dydx(vote) 
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 12 12 2}{...}
{p2col:dy/dx wrt:}{res:1.vote}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 13 13 2}{...}
{p2col:{txt:1._predict:}}{res:Pr(level==1), predict(pr outcome(1))}{p_end}
{p2col:{txt:2._predict:}}{res:Pr(level==2), predict(pr outcome(2))}{p_end}
{p2col:{txt:3._predict:}}{res:Pr(level==3), predict(pr outcome(3))}{p_end}
{p2col:{txt:4._predict:}}{res:Pr(level==4), predict(pr outcome(4))}{p_end}
{p2col:{txt:5._predict:}}{res:Pr(level==5), predict(pr outcome(5))}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0.vote      {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1.vote       {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0260857{col 26}{space 2} .0014562{col 37}{space 1}  -17.91{col 46}{space 3}0.000{col 54}{space 4}-.0289397{col 67}{space 3}-.0232317
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0357925{col 26}{space 2} .0025635{col 37}{space 1}  -13.96{col 46}{space 3}0.000{col 54}{space 4}-.0408168{col 67}{space 3}-.0307682
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0242148{col 26}{space 2} .0001714{col 37}{space 1} -141.24{col 46}{space 3}0.000{col 54}{space 4}-.0245508{col 67}{space 3}-.0238788
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0106506{col 26}{space 2} .0026485{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4} .0054597{col 67}{space 3} .0158416
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0754424{col 26}{space 2} .0013394{col 37}{space 1}   56.32{col 46}{space 3}0.000{col 54}{space 4} .0728171{col 67}{space 3} .0780676
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 78}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. oprobit level i.vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ i.region [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-7562.2895}  
Iteration 1:{space 3}log pseudolikelihood = {res: -7340.945}  
Iteration 2:{space 3}log pseudolikelihood = {res:-7340.8561}  
Iteration 3:{space 3}log pseudolikelihood = {res:-7340.8561}  
{res}
{txt}{col 1}Ordered probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(0)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-7340.8561}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0293}

{txt}{ralign 80:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         level{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}
{space 10}Yes  {c |}{col 16}{res}{space 2} .2084886{col 28}{space 2} .0254085{col 39}{space 1}    8.21{col 48}{space 3}0.000{col 56}{space 4} .1586888{col 69}{space 3} .2582885
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0699521{col 28}{space 2} .0212963{col 39}{space 1}   -3.28{col 48}{space 3}0.001{col 56}{space 4}-.1116921{col 69}{space 3}-.0282122
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0032793{col 28}{space 2} .0003151{col 39}{space 1}   10.41{col 48}{space 3}0.000{col 56}{space 4} .0026618{col 69}{space 3} .0038968
{txt}{space 11}Han {c |}{col 16}{res}{space 2} -.282549{col 28}{space 2} .0615018{col 39}{space 1}   -4.59{col 48}{space 3}0.000{col 56}{space 4}-.4030904{col 69}{space 3}-.1620076
{txt}{space 11}mar {c |}{col 16}{res}{space 2} -.104234{col 28}{space 2} .0020556{col 39}{space 1}  -50.71{col 48}{space 3}0.000{col 56}{space 4}-.1082628{col 69}{space 3}-.1002052
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1723088{col 28}{space 2} .0139514{col 39}{space 1}  -12.35{col 48}{space 3}0.000{col 56}{space 4}-.1996529{col 69}{space 3}-.1449646
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0156123{col 28}{space 2} .0003055{col 39}{space 1}  -51.10{col 48}{space 3}0.000{col 56}{space 4}-.0162111{col 69}{space 3}-.0150135
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1035476{col 28}{space 2} .0262488{col 39}{space 1}   -3.94{col 48}{space 3}0.000{col 56}{space 4}-.1549943{col 69}{space 3}-.0521008
{txt}{space 9}party {c |}{col 16}{res}{space 2}  .060144{col 28}{space 2} .0370371{col 39}{space 1}    1.62{col 48}{space 3}0.104{col 56}{space 4}-.0124474{col 69}{space 3} .1327355
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .4339781{col 28}{space 2} .0130934{col 39}{space 1}   33.14{col 48}{space 3}0.000{col 56}{space 4} .4083156{col 69}{space 3} .4596407
{txt}{space 11}cap {c |}{col 16}{res}{space 2}-.0090069{col 28}{space 2} .0248392{col 39}{space 1}   -0.36{col 48}{space 3}0.717{col 56}{space 4}-.0576909{col 69}{space 3} .0396771
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0546937{col 28}{space 2} .0095301{col 39}{space 1}    5.74{col 48}{space 3}0.000{col 56}{space 4} .0360151{col 69}{space 3} .0733722
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0432238{col 28}{space 2} .0169942{col 39}{space 1}   -2.54{col 48}{space 3}0.011{col 56}{space 4}-.0765318{col 69}{space 3}-.0099158
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2}  .319057{col 28}{space 2}  .036058{col 39}{space 1}    8.85{col 48}{space 3}0.000{col 56}{space 4} .2483846{col 69}{space 3} .3897294
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0192756{col 28}{space 2} .1164226{col 39}{space 1}   -0.17{col 48}{space 3}0.868{col 56}{space 4}-.2474597{col 69}{space 3} .2089085
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .1842019{col 28}{space 2} .1151621{col 39}{space 1}    1.60{col 48}{space 3}0.110{col 56}{space 4}-.0415116{col 69}{space 3} .4099154
{txt}{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}/cut1 {c |}{col 16}{res}{space 2}-1.559725{col 28}{space 2} .1197715{col 56}{space 4}-1.794473{col 69}{space 3}-1.324977
{txt}{space 9}/cut2 {c |}{col 16}{res}{space 2}-.8387422{col 28}{space 2} .1327928{col 56}{space 4}-1.099011{col 69}{space 3}-.5784731
{txt}{space 9}/cut3 {c |}{col 16}{res}{space 2}-.3041208{col 28}{space 2} .1195524{col 56}{space 4}-.5384393{col 69}{space 3}-.0698023
{txt}{space 9}/cut4 {c |}{col 16}{res}{space 2} .7781843{col 28}{space 2} .0838476{col 56}{space 4}  .613846{col 69}{space 3} .9425225
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, dydx(vote) 
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 12 12 2}{...}
{p2col:dy/dx wrt:}{res:1.vote}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 13 13 2}{...}
{p2col:{txt:1._predict:}}{res:Pr(level==1), predict(pr outcome(1))}{p_end}
{p2col:{txt:2._predict:}}{res:Pr(level==2), predict(pr outcome(2))}{p_end}
{p2col:{txt:3._predict:}}{res:Pr(level==3), predict(pr outcome(3))}{p_end}
{p2col:{txt:4._predict:}}{res:Pr(level==4), predict(pr outcome(4))}{p_end}
{p2col:{txt:5._predict:}}{res:Pr(level==5), predict(pr outcome(5))}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0.vote      {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1.vote       {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0222205{col 26}{space 2} .0019471{col 37}{space 1}  -11.41{col 46}{space 3}0.000{col 54}{space 4}-.0260367{col 67}{space 3}-.0184042
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0305439{col 26}{space 2} .0038051{col 37}{space 1}   -8.03{col 46}{space 3}0.000{col 54}{space 4}-.0380017{col 67}{space 3}-.0230861
{txt}{space 10}3  {c |}{col 14}{res}{space 2} -.020962{col 26}{space 2} .0017734{col 37}{space 1}  -11.82{col 46}{space 3}0.000{col 54}{space 4}-.0244377{col 67}{space 3}-.0174862
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0087719{col 26}{space 2} .0085106{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4}-.0079085{col 67}{space 3} .0254524
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0649544{col 26}{space 2} .0047833{col 37}{space 1}   13.58{col 46}{space 3}0.000{col 54}{space 4} .0555793{col 67}{space 3} .0743296
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 78}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. oprobit level i.vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ i.region reli health read internet tv [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-7562.2895}  
Iteration 1:{space 3}log pseudolikelihood = {res:-7326.2143}  
Iteration 2:{space 3}log pseudolikelihood = {res: -7326.104}  
Iteration 3:{space 3}log pseudolikelihood = {res: -7326.104}  
{res}
{txt}{col 1}Ordered probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(0)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 9:-7326.104}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0312}

{txt}{ralign 80:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         level{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}
{space 10}Yes  {c |}{col 16}{res}{space 2} .2038116{col 28}{space 2} .0223916{col 39}{space 1}    9.10{col 48}{space 3}0.000{col 56}{space 4} .1599249{col 69}{space 3} .2476983
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0813646{col 28}{space 2} .0183696{col 39}{space 1}   -4.43{col 48}{space 3}0.000{col 56}{space 4}-.1173683{col 69}{space 3}-.0453609
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0029659{col 28}{space 2} .0009188{col 39}{space 1}    3.23{col 48}{space 3}0.001{col 56}{space 4} .0011651{col 69}{space 3} .0047668
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.3150798{col 28}{space 2}  .045663{col 39}{space 1}   -6.90{col 48}{space 3}0.000{col 56}{space 4}-.4045776{col 69}{space 3}-.2255819
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1183435{col 28}{space 2} .0057294{col 39}{space 1}  -20.66{col 48}{space 3}0.000{col 56}{space 4}-.1295729{col 69}{space 3} -.107114
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1664633{col 28}{space 2} .0079544{col 39}{space 1}  -20.93{col 48}{space 3}0.000{col 56}{space 4}-.1820537{col 69}{space 3}-.1508729
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0154866{col 28}{space 2} .0005076{col 39}{space 1}  -30.51{col 48}{space 3}0.000{col 56}{space 4}-.0164815{col 69}{space 3}-.0144917
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.0969839{col 28}{space 2}  .022755{col 39}{space 1}   -4.26{col 48}{space 3}0.000{col 56}{space 4}-.1415829{col 69}{space 3} -.052385
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0635149{col 28}{space 2} .0349015{col 39}{space 1}    1.82{col 48}{space 3}0.069{col 56}{space 4}-.0048908{col 69}{space 3} .1319206
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .4294024{col 28}{space 2}  .011319{col 39}{space 1}   37.94{col 48}{space 3}0.000{col 56}{space 4} .4072176{col 69}{space 3} .4515872
{txt}{space 11}cap {c |}{col 16}{res}{space 2}-.0080026{col 28}{space 2}  .025591{col 39}{space 1}   -0.31{col 48}{space 3}0.754{col 56}{space 4}  -.05816{col 69}{space 3} .0421548
{txt}{space 8}compli {c |}{col 16}{res}{space 2}  .054841{col 28}{space 2} .0092515{col 39}{space 1}    5.93{col 48}{space 3}0.000{col 56}{space 4} .0367085{col 69}{space 3} .0729736
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0473881{col 28}{space 2} .0176993{col 39}{space 1}   -2.68{col 48}{space 3}0.007{col 56}{space 4}-.0820781{col 69}{space 3}-.0126981
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .3018803{col 28}{space 2} .0257997{col 39}{space 1}   11.70{col 48}{space 3}0.000{col 56}{space 4} .2513138{col 69}{space 3} .3524467
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0283794{col 28}{space 2} .1120363{col 39}{space 1}   -0.25{col 48}{space 3}0.800{col 56}{space 4}-.2479666{col 69}{space 3} .1912078
{txt}{space 12}4  {c |}{col 16}{res}{space 2}  .172294{col 28}{space 2} .1061227{col 39}{space 1}    1.62{col 48}{space 3}0.104{col 56}{space 4}-.0357027{col 69}{space 3} .3802907
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2}-.1249891{col 28}{space 2} .0365793{col 39}{space 1}   -3.42{col 48}{space 3}0.001{col 56}{space 4}-.1966832{col 69}{space 3} -.053295
{txt}{space 8}health {c |}{col 16}{res}{space 2} .1037386{col 28}{space 2}  .052537{col 39}{space 1}    1.97{col 48}{space 3}0.048{col 56}{space 4}  .000768{col 69}{space 3} .2067091
{txt}{space 10}read {c |}{col 16}{res}{space 2}  .030083{col 28}{space 2} .0096927{col 39}{space 1}    3.10{col 48}{space 3}0.002{col 56}{space 4} .0110856{col 69}{space 3} .0490804
{txt}{space 6}internet {c |}{col 16}{res}{space 2}-.1427028{col 28}{space 2} .0332916{col 39}{space 1}   -4.29{col 48}{space 3}0.000{col 56}{space 4}-.2079532{col 69}{space 3}-.0774525
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.0753683{col 28}{space 2} .0111301{col 39}{space 1}   -6.77{col 48}{space 3}0.000{col 56}{space 4}-.0971829{col 69}{space 3}-.0535536
{txt}{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}/cut1 {c |}{col 16}{res}{space 2}-1.670179{col 28}{space 2} .0431896{col 56}{space 4}-1.754829{col 69}{space 3}-1.585529
{txt}{space 9}/cut2 {c |}{col 16}{res}{space 2}-.9477222{col 28}{space 2} .0547578{col 56}{space 4}-1.055045{col 69}{space 3}-.8403988
{txt}{space 9}/cut3 {c |}{col 16}{res}{space 2}-.4122196{col 28}{space 2} .0424748{col 56}{space 4}-.4954687{col 69}{space 3}-.3289705
{txt}{space 9}/cut4 {c |}{col 16}{res}{space 2} .6739639{col 28}{space 2}  .015938{col 56}{space 4} .6427261{col 69}{space 3} .7052018
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. margins, dydx(vote) 
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 12 12 2}{...}
{p2col:dy/dx wrt:}{res:1.vote}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 13 13 2}{...}
{p2col:{txt:1._predict:}}{res:Pr(level==1), predict(pr outcome(1))}{p_end}
{p2col:{txt:2._predict:}}{res:Pr(level==2), predict(pr outcome(2))}{p_end}
{p2col:{txt:3._predict:}}{res:Pr(level==3), predict(pr outcome(3))}{p_end}
{p2col:{txt:4._predict:}}{res:Pr(level==4), predict(pr outcome(4))}{p_end}
{p2col:{txt:5._predict:}}{res:Pr(level==5), predict(pr outcome(5))}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}0.vote      {col 14}{txt}{c |}  (base outcome)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}1.vote       {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0216549{col 26}{space 2} .0013473{col 37}{space 1}  -16.07{col 46}{space 3}0.000{col 54}{space 4}-.0242955{col 67}{space 3}-.0190144
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0297183{col 26}{space 2} .0025794{col 37}{space 1}  -11.52{col 46}{space 3}0.000{col 54}{space 4}-.0347738{col 67}{space 3}-.0246628
{txt}{space 10}3  {c |}{col 14}{res}{space 2} -.020425{col 26}{space 2}  .000447{col 37}{space 1}  -45.70{col 46}{space 3}0.000{col 54}{space 4}-.0213011{col 67}{space 3} -.019549
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0084462{col 26}{space 2} .0031442{col 37}{space 1}    2.69{col 46}{space 3}0.007{col 54}{space 4} .0022838{col 67}{space 3} .0146087
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0633521{col 26}{space 2} .0016498{col 37}{space 1}   38.40{col 46}{space 3}0.000{col 54}{space 4} .0601186{col 67}{space 3} .0665856
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 78}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. 
. *Appendix B
. probit trust vote, robust

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2958.4367}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2932.2503}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2932.2461}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2932.2461}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:Wald chi2({res:1})}{col 70} = {res}{ralign 6:52.46}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2932.2461}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0089}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2}  .287401{col 26}{space 2}   .03968{col 37}{space 1}    7.24{col 46}{space 3}0.000{col 54}{space 4} .2096295{col 67}{space 3} .3651725
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2510886{col 26}{space 2} .0316583{col 37}{space 1}    7.93{col 46}{space 3}0.000{col 54}{space 4} .1890395{col 67}{space 3} .3131377
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6684561    .0502574   .5991272   .7048804
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,657 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,113 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,544      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      3,113      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho, robust

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2958.4367}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2889.3177}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2889.1462}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2889.1461}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:Wald chi2({res:6})}{col 70} = {res}{ralign 6:137.37}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2889.1461}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0234}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .2885881{col 26}{space 2} .0409567{col 37}{space 1}    7.05{col 46}{space 3}0.000{col 54}{space 4} .2083144{col 67}{space 3} .3688618
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1058785{col 26}{space 2} .0393918{col 37}{space 1}   -2.69{col 46}{space 3}0.007{col 54}{space 4} -.183085{col 67}{space 3} -.028672
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0035542{col 26}{space 2} .0014787{col 37}{space 1}    2.40{col 46}{space 3}0.016{col 54}{space 4}  .000656{col 67}{space 3} .0064523
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.4167741{col 26}{space 2} .0653299{col 37}{space 1}   -6.38{col 46}{space 3}0.000{col 54}{space 4}-.5448185{col 67}{space 3}-.2887298
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.1058051{col 26}{space 2} .0542147{col 37}{space 1}   -1.95{col 46}{space 3}0.051{col 54}{space 4}-.2120639{col 67}{space 3} .0004537
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}-.1366658{col 26}{space 2} .0438294{col 37}{space 1}   -3.12{col 46}{space 3}0.002{col 54}{space 4}-.2225699{col 67}{space 3}-.0507617
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6554711{col 26}{space 2} .1103959{col 37}{space 1}    5.94{col 46}{space 3}0.000{col 54}{space 4}  .439099{col 67}{space 3} .8718432
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657     .668541    .0805052   .4817836     .89035
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,608 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,116 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,518       98.32       98.32
{txt}          1 {c |}{res}         26        1.68      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         23        0.74        0.74
{txt}          1 {c |}{res}      3,090       99.26      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc_imputed below_aver, robust

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2958.4367}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2886.5413}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2886.3629}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2886.3629}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:Wald chi2({res:8})}{col 70} = {res}{ralign 6:141.90}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2886.3629}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0244}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .2832067{col 28}{space 2} .0411117{col 39}{space 1}    6.89{col 48}{space 3}0.000{col 56}{space 4} .2026292{col 69}{space 3} .3637842
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0903943{col 28}{space 2} .0413886{col 39}{space 1}   -2.18{col 48}{space 3}0.029{col 56}{space 4}-.1715145{col 69}{space 3}-.0092741
{txt}{space 11}age {c |}{col 16}{res}{space 2}  .003431{col 28}{space 2}  .001505{col 39}{space 1}    2.28{col 48}{space 3}0.023{col 56}{space 4} .0004814{col 69}{space 3} .0063807
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.4118555{col 28}{space 2} .0654703{col 39}{space 1}   -6.29{col 48}{space 3}0.000{col 56}{space 4} -.540175{col 69}{space 3}-.2835361
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1046364{col 28}{space 2} .0547766{col 39}{space 1}   -1.91{col 48}{space 3}0.056{col 56}{space 4}-.2119966{col 69}{space 3} .0027238
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1454608{col 28}{space 2} .0441878{col 39}{space 1}   -3.29{col 48}{space 3}0.001{col 56}{space 4}-.2320673{col 69}{space 3}-.0588542
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0079248{col 28}{space 2} .0077195{col 39}{space 1}   -1.03{col 48}{space 3}0.305{col 56}{space 4}-.0230548{col 69}{space 3} .0072051
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.0887857{col 28}{space 2} .0396871{col 39}{space 1}   -2.24{col 48}{space 3}0.025{col 56}{space 4}-.1665709{col 69}{space 3}-.0110005
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .7556884{col 28}{space 2} .1280592{col 39}{space 1}    5.90{col 48}{space 3}0.000{col 56}{space 4} .5046971{col 69}{space 3}  1.00668
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6685249    .0820462   .4674891   .9031403
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,587 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,109 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,511       97.86       97.86
{txt}          1 {c |}{res}         33        2.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         37        1.19        1.19
{txt}          1 {c |}{res}      3,076       98.81      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ, robust

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2958.4367}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2837.2749}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2836.9501}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2836.9501}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:Wald chi2({res:13})}{col 70} = {res}{ralign 6:235.84}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2836.9501}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0411}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .2676387{col 28}{space 2} .0415218{col 39}{space 1}    6.45{col 48}{space 3}0.000{col 56}{space 4} .1862575{col 69}{space 3}   .34902
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0868035{col 28}{space 2} .0422137{col 39}{space 1}   -2.06{col 48}{space 3}0.040{col 56}{space 4}-.1695408{col 69}{space 3}-.0040663
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0019374{col 28}{space 2} .0015344{col 39}{space 1}    1.26{col 48}{space 3}0.207{col 56}{space 4}  -.00107{col 69}{space 3} .0049449
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.4137874{col 28}{space 2} .0661769{col 39}{space 1}   -6.25{col 48}{space 3}0.000{col 56}{space 4}-.5434918{col 69}{space 3} -.284083
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1115031{col 28}{space 2} .0554884{col 39}{space 1}   -2.01{col 48}{space 3}0.044{col 56}{space 4}-.2202583{col 69}{space 3}-.0027478
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1219397{col 28}{space 2} .0452245{col 39}{space 1}   -2.70{col 48}{space 3}0.007{col 56}{space 4}-.2105782{col 69}{space 3}-.0333012
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0106375{col 28}{space 2} .0077744{col 39}{space 1}   -1.37{col 48}{space 3}0.171{col 56}{space 4}-.0258751{col 69}{space 3} .0046001
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2} -.098066{col 28}{space 2} .0401024{col 39}{space 1}   -2.45{col 48}{space 3}0.014{col 56}{space 4}-.1766652{col 69}{space 3}-.0194667
{txt}{space 9}party {c |}{col 16}{res}{space 2} .0918709{col 28}{space 2} .0922326{col 39}{space 1}    1.00{col 48}{space 3}0.319{col 56}{space 4}-.0889018{col 69}{space 3} .2726435
{txt}{space 8}submit {c |}{col 16}{res}{space 2}  .485533{col 28}{space 2} .0499507{col 39}{space 1}    9.72{col 48}{space 3}0.000{col 56}{space 4} .3876315{col 69}{space 3} .5834345
{txt}{space 11}cap {c |}{col 16}{res}{space 2}-.0034675{col 28}{space 2} .0490964{col 39}{space 1}   -0.07{col 48}{space 3}0.944{col 56}{space 4}-.0996945{col 69}{space 3} .0927596
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0528052{col 28}{space 2} .0449182{col 39}{space 1}    1.18{col 48}{space 3}0.240{col 56}{space 4}-.0352329{col 69}{space 3} .1408432
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2} -.089449{col 28}{space 2} .0421833{col 39}{space 1}   -2.12{col 48}{space 3}0.034{col 56}{space 4}-.1721268{col 69}{space 3}-.0067712
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .4813124{col 28}{space 2} .1371463{col 39}{space 1}    3.51{col 48}{space 3}0.000{col 56}{space 4} .2125107{col 69}{space 3} .7501141
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657     .668451    .1074413   .3107654   .9142036
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,247 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,165 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,313       85.04       85.04
{txt}          1 {c |}{res}        231       14.96      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        179        5.75        5.75
{txt}          1 {c |}{res}      2,934       94.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ i.region, robust

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2958.4367}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2800.3295}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2799.6689}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2799.6689}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:Wald chi2({res:16})}{col 70} = {res}{ralign 6:303.59}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2799.6689}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0537}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .2141639{col 28}{space 2}  .042068{col 39}{space 1}    5.09{col 48}{space 3}0.000{col 56}{space 4} .1317123{col 69}{space 3} .2966156
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0736083{col 28}{space 2} .0424999{col 39}{space 1}   -1.73{col 48}{space 3}0.083{col 56}{space 4}-.1569067{col 69}{space 3} .0096901
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0032837{col 28}{space 2}  .001564{col 39}{space 1}    2.10{col 48}{space 3}0.036{col 56}{space 4} .0002184{col 69}{space 3}  .006349
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.3482804{col 28}{space 2} .0683772{col 39}{space 1}   -5.09{col 48}{space 3}0.000{col 56}{space 4}-.4822973{col 69}{space 3}-.2142635
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1029796{col 28}{space 2} .0557713{col 39}{space 1}   -1.85{col 48}{space 3}0.065{col 56}{space 4}-.2122893{col 69}{space 3} .0063301
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1137821{col 28}{space 2} .0457796{col 39}{space 1}   -2.49{col 48}{space 3}0.013{col 56}{space 4}-.2035084{col 69}{space 3}-.0240557
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0165015{col 28}{space 2} .0078329{col 39}{space 1}   -2.11{col 48}{space 3}0.035{col 56}{space 4}-.0318537{col 69}{space 3}-.0011493
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1236998{col 28}{space 2} .0405308{col 39}{space 1}   -3.05{col 48}{space 3}0.002{col 56}{space 4}-.2031387{col 69}{space 3}-.0442609
{txt}{space 9}party {c |}{col 16}{res}{space 2}  .110636{col 28}{space 2} .0927323{col 39}{space 1}    1.19{col 48}{space 3}0.233{col 56}{space 4} -.071116{col 69}{space 3}  .292388
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .4796923{col 28}{space 2} .0504552{col 39}{space 1}    9.51{col 48}{space 3}0.000{col 56}{space 4}  .380802{col 69}{space 3} .5785826
{txt}{space 11}cap {c |}{col 16}{res}{space 2}-.0042144{col 28}{space 2} .0496385{col 39}{space 1}   -0.08{col 48}{space 3}0.932{col 56}{space 4} -.101504{col 69}{space 3} .0930752
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0465558{col 28}{space 2} .0451947{col 39}{space 1}    1.03{col 48}{space 3}0.303{col 56}{space 4}-.0420242{col 69}{space 3} .1351358
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0735856{col 28}{space 2}  .042508{col 39}{space 1}   -1.73{col 48}{space 3}0.083{col 56}{space 4}-.1568998{col 69}{space 3} .0097285
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .4771043{col 28}{space 2} .0749252{col 39}{space 1}    6.37{col 48}{space 3}0.000{col 56}{space 4} .3302536{col 69}{space 3}  .623955
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0678662{col 28}{space 2} .0535037{col 39}{space 1}   -1.27{col 48}{space 3}0.205{col 56}{space 4}-.1727315{col 69}{space 3} .0369992
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .1937134{col 28}{space 2} .0554765{col 39}{space 1}    3.49{col 48}{space 3}0.000{col 56}{space 4} .0849815{col 69}{space 3} .3024453
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} .3338118{col 28}{space 2} .1445639{col 39}{space 1}    2.31{col 48}{space 3}0.021{col 56}{space 4} .0504717{col 69}{space 3} .6171519
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6683934    .1220907   .2808297   .9351072
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,166 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,198 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,256       81.35       81.35
{txt}          1 {c |}{res}        288       18.65      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        203        6.52        6.52
{txt}          1 {c |}{res}      2,910       93.48      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ i.region reli health read internet tv, robust

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2958.4367}  
Iteration 1:{space 3}log pseudolikelihood = {res: -2794.837}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2794.1142}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2794.1141}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:Wald chi2({res:21})}{col 70} = {res}{ralign 6:312.97}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2794.1141}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0555}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .2149786{col 28}{space 2} .0422444{col 39}{space 1}    5.09{col 48}{space 3}0.000{col 56}{space 4} .1321811{col 69}{space 3} .2977761
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0831973{col 28}{space 2} .0431991{col 39}{space 1}   -1.93{col 48}{space 3}0.054{col 56}{space 4}-.1678659{col 69}{space 3} .0014713
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0031836{col 28}{space 2} .0017217{col 39}{space 1}    1.85{col 48}{space 3}0.064{col 56}{space 4} -.000191{col 69}{space 3} .0065581
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.3768416{col 28}{space 2} .0697436{col 39}{space 1}   -5.40{col 48}{space 3}0.000{col 56}{space 4}-.5135365{col 69}{space 3}-.2401467
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1018183{col 28}{space 2} .0571694{col 39}{space 1}   -1.78{col 48}{space 3}0.075{col 56}{space 4}-.2138682{col 69}{space 3} .0102316
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1056624{col 28}{space 2}  .047197{col 39}{space 1}   -2.24{col 48}{space 3}0.025{col 56}{space 4}-.1981669{col 69}{space 3}-.0131579
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2} -.015818{col 28}{space 2} .0078589{col 39}{space 1}   -2.01{col 48}{space 3}0.044{col 56}{space 4}-.0312211{col 69}{space 3}-.0004148
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1197946{col 28}{space 2} .0416581{col 39}{space 1}   -2.88{col 48}{space 3}0.004{col 56}{space 4}-.2014429{col 69}{space 3}-.0381462
{txt}{space 9}party {c |}{col 16}{res}{space 2} .1102693{col 28}{space 2} .0939713{col 39}{space 1}    1.17{col 48}{space 3}0.241{col 56}{space 4}-.0739111{col 69}{space 3} .2944496
{txt}{space 8}submit {c |}{col 16}{res}{space 2}   .47787{col 28}{space 2} .0506706{col 39}{space 1}    9.43{col 48}{space 3}0.000{col 56}{space 4} .3785574{col 69}{space 3} .5771825
{txt}{space 11}cap {c |}{col 16}{res}{space 2}-.0043607{col 28}{space 2} .0498426{col 39}{space 1}   -0.09{col 48}{space 3}0.930{col 56}{space 4}-.1020503{col 69}{space 3}  .093329
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0447971{col 28}{space 2} .0454364{col 39}{space 1}    0.99{col 48}{space 3}0.324{col 56}{space 4}-.0442565{col 69}{space 3} .1338507
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0744562{col 28}{space 2} .0426012{col 39}{space 1}   -1.75{col 48}{space 3}0.081{col 56}{space 4} -.157953{col 69}{space 3} .0090405
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2}  .466587{col 28}{space 2} .0755016{col 39}{space 1}    6.18{col 48}{space 3}0.000{col 56}{space 4} .3186066{col 69}{space 3} .6145674
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0737617{col 28}{space 2} .0540776{col 39}{space 1}   -1.36{col 48}{space 3}0.173{col 56}{space 4}-.1797519{col 69}{space 3} .0322285
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .1870715{col 28}{space 2} .0563186{col 39}{space 1}    3.32{col 48}{space 3}0.001{col 56}{space 4}  .076689{col 69}{space 3} .2974539
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2}-.1030813{col 28}{space 2} .0589514{col 39}{space 1}   -1.75{col 48}{space 3}0.080{col 56}{space 4}-.2186239{col 69}{space 3} .0124612
{txt}{space 8}health {c |}{col 16}{res}{space 2} .0720077{col 28}{space 2} .0430523{col 39}{space 1}    1.67{col 48}{space 3}0.094{col 56}{space 4}-.0123733{col 69}{space 3} .1563887
{txt}{space 10}read {c |}{col 16}{res}{space 2} .0184622{col 28}{space 2} .0573613{col 39}{space 1}    0.32{col 48}{space 3}0.748{col 56}{space 4}-.0939638{col 69}{space 3} .1308882
{txt}{space 6}internet {c |}{col 16}{res}{space 2}-.0745906{col 28}{space 2} .0697106{col 39}{space 1}   -1.07{col 48}{space 3}0.285{col 56}{space 4}-.2112208{col 69}{space 3} .0620397
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.1047684{col 28}{space 2} .0489589{col 39}{space 1}   -2.14{col 48}{space 3}0.032{col 56}{space 4}-.2007261{col 69}{space 3}-.0088108
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .4283112{col 28}{space 2} .1639337{col 39}{space 1}    2.61{col 48}{space 3}0.009{col 56}{space 4}  .107007{col 69}{space 3} .7496153
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6684495    .1241162   .2571816   .9509583
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,160 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,186 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,259       81.54       81.54
{txt}          1 {c |}{res}        285       18.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        212        6.81        6.81
{txt}          1 {c |}{res}      2,901       93.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote vote_male male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ i.region reli health read internet tv, robust

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2958.4367}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2794.5059}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2793.7927}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2793.7926}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:Wald chi2({res:22})}{col 70} = {res}{ralign 6:313.82}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2793.7926}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0557}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .1842496{col 28}{space 2}  .057146{col 39}{space 1}    3.22{col 48}{space 3}0.001{col 56}{space 4} .0722455{col 69}{space 3} .2962537
{txt}{space 5}vote_male {c |}{col 16}{res}{space 2}  .065572{col 28}{space 2} .0818329{col 39}{space 1}    0.80{col 48}{space 3}0.423{col 56}{space 4}-.0948176{col 69}{space 3} .2259616
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.1251568{col 28}{space 2} .0679045{col 39}{space 1}   -1.84{col 48}{space 3}0.065{col 56}{space 4}-.2582473{col 69}{space 3} .0079336
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0031839{col 28}{space 2}  .001723{col 39}{space 1}    1.85{col 48}{space 3}0.065{col 56}{space 4}-.0001932{col 69}{space 3}  .006561
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.3770972{col 28}{space 2} .0697161{col 39}{space 1}   -5.41{col 48}{space 3}0.000{col 56}{space 4}-.5137382{col 69}{space 3}-.2404561
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1023873{col 28}{space 2}  .057193{col 39}{space 1}   -1.79{col 48}{space 3}0.073{col 56}{space 4}-.2144835{col 69}{space 3} .0097089
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1047974{col 28}{space 2} .0472296{col 39}{space 1}   -2.22{col 48}{space 3}0.026{col 56}{space 4}-.1973656{col 69}{space 3}-.0122291
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2} -.015685{col 28}{space 2} .0078502{col 39}{space 1}   -2.00{col 48}{space 3}0.046{col 56}{space 4}-.0310711{col 69}{space 3}-.0002988
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1190587{col 28}{space 2} .0416644{col 39}{space 1}   -2.86{col 48}{space 3}0.004{col 56}{space 4}-.2007194{col 69}{space 3}-.0373979
{txt}{space 9}party {c |}{col 16}{res}{space 2}  .106622{col 28}{space 2} .0941495{col 39}{space 1}    1.13{col 48}{space 3}0.257{col 56}{space 4}-.0779075{col 69}{space 3} .2911516
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .4782961{col 28}{space 2} .0506671{col 39}{space 1}    9.44{col 48}{space 3}0.000{col 56}{space 4} .3789904{col 69}{space 3} .5776017
{txt}{space 11}cap {c |}{col 16}{res}{space 2}-.0049875{col 28}{space 2} .0498659{col 39}{space 1}   -0.10{col 48}{space 3}0.920{col 56}{space 4}-.1027229{col 69}{space 3} .0927479
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0450121{col 28}{space 2} .0454452{col 39}{space 1}    0.99{col 48}{space 3}0.322{col 56}{space 4}-.0440589{col 69}{space 3} .1340831
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2} -.074753{col 28}{space 2} .0426031{col 39}{space 1}   -1.75{col 48}{space 3}0.079{col 56}{space 4}-.1582534{col 69}{space 3} .0087475
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .4661513{col 28}{space 2} .0755126{col 39}{space 1}    6.17{col 48}{space 3}0.000{col 56}{space 4} .3181494{col 69}{space 3} .6141532
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0744327{col 28}{space 2} .0540953{col 39}{space 1}   -1.38{col 48}{space 3}0.169{col 56}{space 4}-.1804576{col 69}{space 3} .0315922
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .1867842{col 28}{space 2} .0563262{col 39}{space 1}    3.32{col 48}{space 3}0.001{col 56}{space 4}  .076387{col 69}{space 3} .2971815
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2}-.1039714{col 28}{space 2} .0589627{col 39}{space 1}   -1.76{col 48}{space 3}0.078{col 56}{space 4}-.2195362{col 69}{space 3} .0115934
{txt}{space 8}health {c |}{col 16}{res}{space 2} .0719392{col 28}{space 2} .0430572{col 39}{space 1}    1.67{col 48}{space 3}0.095{col 56}{space 4}-.0124514{col 69}{space 3} .1563297
{txt}{space 10}read {c |}{col 16}{res}{space 2} .0179687{col 28}{space 2} .0574015{col 39}{space 1}    0.31{col 48}{space 3}0.754{col 56}{space 4}-.0945362{col 69}{space 3} .1304736
{txt}{space 6}internet {c |}{col 16}{res}{space 2}-.0729597{col 28}{space 2} .0698086{col 39}{space 1}   -1.05{col 48}{space 3}0.296{col 56}{space 4}-.2097821{col 69}{space 3} .0638627
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.1042399{col 28}{space 2} .0489577{col 39}{space 1}   -2.13{col 48}{space 3}0.033{col 56}{space 4}-.2001952{col 69}{space 3}-.0082846
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .4453139{col 28}{space 2}  .165581{col 39}{space 1}    2.69{col 48}{space 3}0.007{col 56}{space 4} .1207811{col 69}{space 3} .7698467
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***F test
. test vote_male + vote=0

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[trust]vote + [trust]vote_male = 0{p_end}

{txt}{col 12}chi2(  1) ={res}   17.05
{txt}{col 10}Prob > chi2 =  {res}  0.0000
{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6684544    .1242985   .2492889   .9493868
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,151 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,189 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,253       81.15       81.15
{txt}          1 {c |}{res}        291       18.85      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        215        6.91        6.91
{txt}          1 {c |}{res}      2,898       93.09      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote vote_party male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ i.region reli health read internet tv, robust

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-2958.4367}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2794.8359}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2794.1132}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2794.1131}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,657}
{txt}{col 57}{lalign 13:Wald chi2({res:22})}{col 70} = {res}{ralign 6:312.98}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2794.1131}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0555}

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}         trust{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .2153193{col 28}{space 2} .0428718{col 39}{space 1}    5.02{col 48}{space 3}0.000{col 56}{space 4} .1312921{col 69}{space 3} .2993465
{txt}{space 4}vote_party {c |}{col 16}{res}{space 2}-.0100278{col 28}{space 2} .2357728{col 39}{space 1}   -0.04{col 48}{space 3}0.966{col 56}{space 4} -.472134{col 69}{space 3} .4520784
{txt}{space 10}male {c |}{col 16}{res}{space 2} -.083204{col 28}{space 2} .0432013{col 39}{space 1}   -1.93{col 48}{space 3}0.054{col 56}{space 4} -.167877{col 69}{space 3}  .001469
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0031825{col 28}{space 2} .0017216{col 39}{space 1}    1.85{col 48}{space 3}0.065{col 56}{space 4}-.0001917{col 69}{space 3} .0065568
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.3767707{col 28}{space 2}  .069748{col 39}{space 1}   -5.40{col 48}{space 3}0.000{col 56}{space 4}-.5134743{col 69}{space 3}-.2400672
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.1018242{col 28}{space 2} .0571698{col 39}{space 1}   -1.78{col 48}{space 3}0.075{col 56}{space 4} -.213875{col 69}{space 3} .0102266
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.1056411{col 28}{space 2}  .047198{col 39}{space 1}   -2.24{col 48}{space 3}0.025{col 56}{space 4}-.1981474{col 69}{space 3}-.0131348
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0158167{col 28}{space 2}  .007859{col 39}{space 1}   -2.01{col 48}{space 3}0.044{col 56}{space 4}-.0312201{col 69}{space 3}-.0004134
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.1198454{col 28}{space 2} .0416422{col 39}{space 1}   -2.88{col 48}{space 3}0.004{col 56}{space 4}-.2014625{col 69}{space 3}-.0382282
{txt}{space 9}party {c |}{col 16}{res}{space 2} .1183129{col 28}{space 2} .2152107{col 39}{space 1}    0.55{col 48}{space 3}0.582{col 56}{space 4}-.3034925{col 69}{space 3} .5401182
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .4778624{col 28}{space 2} .0506731{col 39}{space 1}    9.43{col 48}{space 3}0.000{col 56}{space 4}  .378545{col 69}{space 3} .5771798
{txt}{space 11}cap {c |}{col 16}{res}{space 2} -.004297{col 28}{space 2} .0498805{col 39}{space 1}   -0.09{col 48}{space 3}0.931{col 56}{space 4}-.1020611{col 69}{space 3} .0934671
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0448502{col 28}{space 2} .0454508{col 39}{space 1}    0.99{col 48}{space 3}0.324{col 56}{space 4}-.0442318{col 69}{space 3} .1339322
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0744697{col 28}{space 2} .0426065{col 39}{space 1}   -1.75{col 48}{space 3}0.080{col 56}{space 4}-.1579769{col 69}{space 3} .0090374
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .4665012{col 28}{space 2}  .075491{col 39}{space 1}    6.18{col 48}{space 3}0.000{col 56}{space 4} .3185415{col 69}{space 3} .6144609
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0737829{col 28}{space 2} .0540789{col 39}{space 1}   -1.36{col 48}{space 3}0.172{col 56}{space 4}-.1797755{col 69}{space 3} .0322098
{txt}{space 12}4  {c |}{col 16}{res}{space 2}  .187024{col 28}{space 2} .0563141{col 39}{space 1}    3.32{col 48}{space 3}0.001{col 56}{space 4} .0766504{col 69}{space 3} .2973976
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2} -.103095{col 28}{space 2} .0589517{col 39}{space 1}   -1.75{col 48}{space 3}0.080{col 56}{space 4}-.2186384{col 69}{space 3} .0124483
{txt}{space 8}health {c |}{col 16}{res}{space 2} .0719526{col 28}{space 2} .0430469{col 39}{space 1}    1.67{col 48}{space 3}0.095{col 56}{space 4}-.0124177{col 69}{space 3} .1563229
{txt}{space 10}read {c |}{col 16}{res}{space 2} .0185094{col 28}{space 2} .0573605{col 39}{space 1}    0.32{col 48}{space 3}0.747{col 56}{space 4} -.093915{col 69}{space 3} .1309339
{txt}{space 6}internet {c |}{col 16}{res}{space 2}-.0746423{col 28}{space 2} .0697063{col 39}{space 1}   -1.07{col 48}{space 3}0.284{col 56}{space 4}-.2112641{col 69}{space 3} .0619796
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.1047301{col 28}{space 2} .0489707{col 39}{space 1}   -2.14{col 48}{space 3}0.032{col 56}{space 4}-.2007109{col 69}{space 3}-.0087493
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .4280961{col 28}{space 2} .1640109{col 39}{space 1}    2.61{col 48}{space 3}0.009{col 56}{space 4} .1066407{col 69}{space 3} .7495515
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***F test
. test vote_party + vote=0

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[trust]vote + [trust]vote_party = 0{p_end}

{txt}{col 12}chi2(  1) ={res}    0.78
{txt}{col 10}Prob > chi2 =  {res}  0.3769
{txt}
{com}. ***margin
. margin,dydx(*)
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,657}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(trust), predict()}{p_end}
{p2col:dy/dx wrt:}{res:vote vote_party male age Han mar prim_scho lg_inc_imputed below_aver party submit cap compli no_influ 2.region 3.region 4.region reli health read internet tv}{p_end}
{p2colreset}{...}

{res}{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28} Delta-method
{col 16}{c |}      dy/dx{col 28}   std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}vote {c |}{col 16}{res}{space 2} .0735046{col 28}{space 2}  .014528{col 39}{space 1}    5.06{col 48}{space 3}0.000{col 56}{space 4} .0450302{col 69}{space 3} .1019791
{txt}{space 4}vote_party {c |}{col 16}{res}{space 2}-.0034233{col 28}{space 2} .0804865{col 39}{space 1}   -0.04{col 48}{space 3}0.966{col 56}{space 4}-.1611739{col 69}{space 3} .1543274
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.0284038{col 28}{space 2} .0147307{col 39}{space 1}   -1.93{col 48}{space 3}0.054{col 56}{space 4}-.0572754{col 69}{space 3} .0004679
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0010864{col 28}{space 2}  .000587{col 39}{space 1}    1.85{col 48}{space 3}0.064{col 56}{space 4} -.000064{col 69}{space 3} .0022369
{txt}{space 11}Han {c |}{col 16}{res}{space 2}-.1286201{col 28}{space 2} .0236461{col 39}{space 1}   -5.44{col 48}{space 3}0.000{col 56}{space 4}-.1749656{col 69}{space 3}-.0822746
{txt}{space 11}mar {c |}{col 16}{res}{space 2}-.0347602{col 28}{space 2} .0194947{col 39}{space 1}   -1.78{col 48}{space 3}0.075{col 56}{space 4}-.0729692{col 69}{space 3} .0034488
{txt}{space 5}prim_scho {c |}{col 16}{res}{space 2}-.0360632{col 28}{space 2} .0160892{col 39}{space 1}   -2.24{col 48}{space 3}0.025{col 56}{space 4}-.0675975{col 69}{space 3} -.004529
{txt}lg_inc_imputed {c |}{col 16}{res}{space 2}-.0053994{col 28}{space 2} .0026794{col 39}{space 1}   -2.02{col 48}{space 3}0.044{col 56}{space 4} -.010651{col 69}{space 3}-.0001479
{txt}{space 4}below_aver {c |}{col 16}{res}{space 2}-.0409122{col 28}{space 2}  .014174{col 39}{space 1}   -2.89{col 48}{space 3}0.004{col 56}{space 4}-.0686928{col 69}{space 3}-.0131317
{txt}{space 9}party {c |}{col 16}{res}{space 2}  .040389{col 28}{space 2}  .073456{col 39}{space 1}    0.55{col 48}{space 3}0.582{col 56}{space 4}-.1035821{col 69}{space 3} .1843602
{txt}{space 8}submit {c |}{col 16}{res}{space 2} .1631303{col 28}{space 2} .0167959{col 39}{space 1}    9.71{col 48}{space 3}0.000{col 56}{space 4} .1302109{col 69}{space 3} .1960496
{txt}{space 11}cap {c |}{col 16}{res}{space 2}-.0014669{col 28}{space 2}  .017028{col 39}{space 1}   -0.09{col 48}{space 3}0.931{col 56}{space 4}-.0348412{col 69}{space 3} .0319074
{txt}{space 8}compli {c |}{col 16}{res}{space 2} .0153107{col 28}{space 2} .0155082{col 39}{space 1}    0.99{col 48}{space 3}0.324{col 56}{space 4}-.0150847{col 69}{space 3} .0457062
{txt}{space 6}no_influ {c |}{col 16}{res}{space 2}-.0254221{col 28}{space 2} .0145267{col 39}{space 1}   -1.75{col 48}{space 3}0.080{col 56}{space 4} -.053894{col 69}{space 3} .0030498
{txt}{space 14} {c |}
{space 8}region {c |}
{space 12}2  {c |}{col 16}{res}{space 2} .1501485{col 28}{space 2} .0230747{col 39}{space 1}    6.51{col 48}{space 3}0.000{col 56}{space 4} .1049229{col 69}{space 3} .1953742
{txt}{space 12}3  {c |}{col 16}{res}{space 2}-.0268102{col 28}{space 2}  .019595{col 39}{space 1}   -1.37{col 48}{space 3}0.171{col 56}{space 4}-.0652158{col 69}{space 3} .0115953
{txt}{space 12}4  {c |}{col 16}{res}{space 2} .0647389{col 28}{space 2} .0196567{col 39}{space 1}    3.29{col 48}{space 3}0.001{col 56}{space 4} .0262126{col 69}{space 3} .1032653
{txt}{space 14} {c |}
{space 10}reli {c |}{col 16}{res}{space 2}-.0351941{col 28}{space 2} .0201108{col 39}{space 1}   -1.75{col 48}{space 3}0.080{col 56}{space 4}-.0746104{col 69}{space 3} .0042223
{txt}{space 8}health {c |}{col 16}{res}{space 2} .0245628{col 28}{space 2} .0146812{col 39}{space 1}    1.67{col 48}{space 3}0.094{col 56}{space 4}-.0042118{col 69}{space 3} .0533374
{txt}{space 10}read {c |}{col 16}{res}{space 2} .0063187{col 28}{space 2} .0195809{col 39}{space 1}    0.32{col 48}{space 3}0.747{col 56}{space 4}-.0320593{col 69}{space 3} .0446966
{txt}{space 6}internet {c |}{col 16}{res}{space 2} -.025481{col 28}{space 2} .0237898{col 39}{space 1}   -1.07{col 48}{space 3}0.284{col 56}{space 4}-.0721081{col 69}{space 3} .0211461
{txt}{space 12}tv {c |}{col 16}{res}{space 2}-.0357522{col 28}{space 2} .0166929{col 39}{space 1}   -2.14{col 48}{space 3}0.032{col 56}{space 4}-.0684698{col 69}{space 3}-.0030347
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 80}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,657    .6684487    .1241168   .2571324   .9509545
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,160 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(3,186 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,259       81.54       81.54
{txt}          1 {c |}{res}        285       18.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,544      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        212        6.81        6.81
{txt}          1 {c |}{res}      2,901       93.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,113      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. *Appendix C
. drop if lg_inc==.
{txt}(514 observations deleted)

{com}. 
. probit trust vote [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3005.9694}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2984.0831}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2984.0805}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2984.0805}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,143}
{txt}{col 57}{lalign 13:Wald chi2({res:1})}{col 70} = {res}{ralign 6:23.57}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2984.0805}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0073}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .2624121{col 26}{space 2} .0540541{col 37}{space 1}    4.85{col 46}{space 3}0.000{col 54}{space 4} .1564679{col 67}{space 3} .3683562
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2399507{col 26}{space 2} .0143181{col 37}{space 1}   16.76{col 46}{space 3}0.000{col 54}{space 4} .2118878{col 67}{space 3} .2680136
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,143    .6595423    .0460479   .5948157   .6922938
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,143 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(2,757 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,386      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,386      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      2,757      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,757      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3005.9694}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2943.4605}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2943.3279}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2943.3279}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,143}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2943.3279}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0208}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .2693593{col 26}{space 2} .0631364{col 37}{space 1}    4.27{col 46}{space 3}0.000{col 54}{space 4} .1456142{col 67}{space 3} .3931044
{txt}{space 8}male {c |}{col 14}{res}{space 2} -.075005{col 26}{space 2} .0412849{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-.1559219{col 67}{space 3}  .005912
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0015329{col 26}{space 2} .0011774{col 37}{space 1}    1.30{col 46}{space 3}0.193{col 54}{space 4}-.0007747{col 67}{space 3} .0038405
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.3943576{col 26}{space 2} .0584136{col 37}{space 1}   -6.75{col 46}{space 3}0.000{col 54}{space 4}-.5088462{col 67}{space 3}-.2798691
{txt}{space 9}mar {c |}{col 14}{res}{space 2} -.150684{col 26}{space 2} .0354053{col 37}{space 1}   -4.26{col 46}{space 3}0.000{col 54}{space 4}-.2200772{col 67}{space 3}-.0812908
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}-.1664801{col 26}{space 2} .0528534{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4} -.270071{col 67}{space 3}-.0628893
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7637081{col 26}{space 2} .0104836{col 37}{space 1}   72.85{col 46}{space 3}0.000{col 54}{space 4} .7431607{col 67}{space 3} .7842555
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,143    .6620461    .0761472   .5019042   .8748388
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,143 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(2,757 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,386      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,386      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      2,757      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,757      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc below_aver [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3005.9694}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2938.8485}  
Iteration 2:{space 3}log pseudolikelihood = {res: -2938.705}  
Iteration 3:{space 3}log pseudolikelihood = {res: -2938.705}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,143}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 9:-2938.705}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0224}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .2623176{col 26}{space 2} .0677636{col 37}{space 1}    3.87{col 46}{space 3}0.000{col 54}{space 4} .1295034{col 67}{space 3} .3951317
{txt}{space 8}male {c |}{col 14}{res}{space 2} -.051757{col 26}{space 2} .0391717{col 37}{space 1}   -1.32{col 46}{space 3}0.186{col 54}{space 4}-.1285321{col 67}{space 3} .0250181
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0011826{col 26}{space 2} .0012908{col 37}{space 1}    0.92{col 46}{space 3}0.360{col 54}{space 4}-.0013473{col 67}{space 3} .0037125
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.3895147{col 26}{space 2} .0546861{col 37}{space 1}   -7.12{col 46}{space 3}0.000{col 54}{space 4}-.4966975{col 67}{space 3} -.282332
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.1409821{col 26}{space 2} .0414552{col 37}{space 1}   -3.40{col 46}{space 3}0.001{col 54}{space 4}-.2222327{col 67}{space 3}-.0597315
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2} -.175341{col 26}{space 2}  .043099{col 37}{space 1}   -4.07{col 46}{space 3}0.000{col 54}{space 4}-.2598135{col 67}{space 3}-.0908685
{txt}{space 6}lg_inc {c |}{col 14}{res}{space 2}-.0122865{col 26}{space 2}  .002801{col 37}{space 1}   -4.39{col 46}{space 3}0.000{col 54}{space 4}-.0177763{col 67}{space 3}-.0067966
{txt}{space 2}below_aver {c |}{col 14}{res}{space 2}-.1068124{col 26}{space 2} .0521156{col 37}{space 1}   -2.05{col 46}{space 3}0.040{col 54}{space 4}-.2089571{col 67}{space 3}-.0046677
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9042121{col 26}{space 2}  .011816{col 37}{space 1}   76.52{col 46}{space 3}0.000{col 54}{space 4} .8810532{col 67}{space 3}  .927371
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,143    .6612853    .0786347   .4781781   .8955158
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(4,048 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(2,758 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,338       96.54       96.54
{txt}          1 {c |}{res}         48        3.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,386      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}         47        1.70        1.70
{txt}          1 {c |}{res}      2,710       98.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,757      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc below_aver party submit cap compli no_influ [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3005.9694}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2886.4694}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2886.1843}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2886.1842}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,143}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2886.1842}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0398}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .2500958{col 26}{space 2} .0695351{col 37}{space 1}    3.60{col 46}{space 3}0.000{col 54}{space 4} .1138095{col 67}{space 3}  .386382
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.0521645{col 26}{space 2}  .033687{col 37}{space 1}   -1.55{col 46}{space 3}0.122{col 54}{space 4}-.1181897{col 67}{space 3} .0138607
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0001951{col 26}{space 2}  .000968{col 37}{space 1}   -0.20{col 46}{space 3}0.840{col 54}{space 4}-.0020923{col 67}{space 3} .0017021
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.3986603{col 26}{space 2} .0446858{col 37}{space 1}   -8.92{col 46}{space 3}0.000{col 54}{space 4} -.486243{col 67}{space 3}-.3110777
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.1304788{col 26}{space 2}  .044718{col 37}{space 1}   -2.92{col 46}{space 3}0.004{col 54}{space 4}-.2181245{col 67}{space 3}-.0428332
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}-.1493203{col 26}{space 2} .0436765{col 37}{space 1}   -3.42{col 46}{space 3}0.001{col 54}{space 4}-.2349247{col 67}{space 3}-.0637158
{txt}{space 6}lg_inc {c |}{col 14}{res}{space 2}-.0155875{col 26}{space 2} .0028263{col 37}{space 1}   -5.52{col 46}{space 3}0.000{col 54}{space 4}-.0211269{col 67}{space 3}-.0100481
{txt}{space 2}below_aver {c |}{col 14}{res}{space 2}-.1177346{col 26}{space 2} .0508708{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.2174396{col 67}{space 3}-.0180296
{txt}{space 7}party {c |}{col 14}{res}{space 2} .0533878{col 26}{space 2} .0318774{col 37}{space 1}    1.67{col 46}{space 3}0.094{col 54}{space 4}-.0090908{col 67}{space 3} .1158664
{txt}{space 6}submit {c |}{col 14}{res}{space 2} .5082468{col 26}{space 2} .0199373{col 37}{space 1}   25.49{col 46}{space 3}0.000{col 54}{space 4} .4691704{col 67}{space 3} .5473231
{txt}{space 9}cap {c |}{col 14}{res}{space 2} .0292761{col 26}{space 2} .0318675{col 37}{space 1}    0.92{col 46}{space 3}0.358{col 54}{space 4} -.033183{col 67}{space 3} .0917352
{txt}{space 6}compli {c |}{col 14}{res}{space 2} .0415236{col 26}{space 2} .0591712{col 37}{space 1}    0.70{col 46}{space 3}0.483{col 54}{space 4}-.0744498{col 67}{space 3} .1574969
{txt}{space 4}no_influ {c |}{col 14}{res}{space 2}-.0600412{col 26}{space 2} .0296253{col 37}{space 1}   -2.03{col 46}{space 3}0.043{col 54}{space 4}-.1181058{col 67}{space 3}-.0019766
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .579555{col 26}{space 2} .0462897{col 37}{space 1}   12.52{col 46}{space 3}0.000{col 54}{space 4} .4888288{col 67}{space 3} .6702812
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,143    .6606726    .1065633   .3166349   .9049826
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(3,744 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(2,808 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,161       83.77       83.77
{txt}          1 {c |}{res}        225       16.23      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,386      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        174        6.31        6.31
{txt}          1 {c |}{res}      2,583       93.69      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,757      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc below_aver party submit cap compli no_influ i.region [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3005.9694}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2856.4009}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2855.8798}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2855.8797}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,143}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2855.8797}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0499}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .2071583{col 26}{space 2} .0765035{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .0572142{col 67}{space 3} .3571024
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.0474955{col 26}{space 2} .0272813{col 37}{space 1}   -1.74{col 46}{space 3}0.082{col 54}{space 4}-.1009659{col 67}{space 3} .0059749
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0012545{col 26}{space 2} .0010342{col 37}{space 1}    1.21{col 46}{space 3}0.225{col 54}{space 4}-.0007726{col 67}{space 3} .0032815
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.3289702{col 26}{space 2} .0604003{col 37}{space 1}   -5.45{col 46}{space 3}0.000{col 54}{space 4}-.4473526{col 67}{space 3}-.2105879
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.1167438{col 26}{space 2} .0340569{col 37}{space 1}   -3.43{col 46}{space 3}0.001{col 54}{space 4}-.1834941{col 67}{space 3}-.0499935
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}-.1350948{col 26}{space 2} .0370662{col 37}{space 1}   -3.64{col 46}{space 3}0.000{col 54}{space 4}-.2077431{col 67}{space 3}-.0624464
{txt}{space 6}lg_inc {c |}{col 14}{res}{space 2}-.0204369{col 26}{space 2} .0043232{col 37}{space 1}   -4.73{col 46}{space 3}0.000{col 54}{space 4}-.0289102{col 67}{space 3}-.0119636
{txt}{space 2}below_aver {c |}{col 14}{res}{space 2}-.1443413{col 26}{space 2} .0548985{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.2519403{col 67}{space 3}-.0367422
{txt}{space 7}party {c |}{col 14}{res}{space 2} .0677605{col 26}{space 2}  .027555{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} .0137538{col 67}{space 3} .1217672
{txt}{space 6}submit {c |}{col 14}{res}{space 2} .5000764{col 26}{space 2} .0187371{col 37}{space 1}   26.69{col 46}{space 3}0.000{col 54}{space 4} .4633523{col 67}{space 3} .5368004
{txt}{space 9}cap {c |}{col 14}{res}{space 2} .0219679{col 26}{space 2} .0324631{col 37}{space 1}    0.68{col 46}{space 3}0.499{col 54}{space 4}-.0416587{col 67}{space 3} .0855945
{txt}{space 6}compli {c |}{col 14}{res}{space 2} .0304168{col 26}{space 2} .0565879{col 37}{space 1}    0.54{col 46}{space 3}0.591{col 54}{space 4}-.0804935{col 67}{space 3} .1413271
{txt}{space 4}no_influ {c |}{col 14}{res}{space 2}-.0463324{col 26}{space 2} .0260926{col 37}{space 1}   -1.78{col 46}{space 3}0.076{col 54}{space 4} -.097473{col 67}{space 3} .0048082
{txt}{space 12} {c |}
{space 6}region {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .4459002{col 26}{space 2} .1032483{col 37}{space 1}    4.32{col 46}{space 3}0.000{col 54}{space 4} .2435373{col 67}{space 3} .6482631
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0419505{col 26}{space 2} .2070987{col 37}{space 1}   -0.20{col 46}{space 3}0.839{col 54}{space 4}-.4478565{col 67}{space 3} .3639554
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .2123874{col 26}{space 2} .1388028{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4}-.0596612{col 67}{space 3} .4844359
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .4110977{col 26}{space 2} .1760477{col 37}{space 1}    2.34{col 46}{space 3}0.020{col 54}{space 4} .0660506{col 67}{space 3} .7561449
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,143    .6627123     .119224   .2806821   .9321661
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(3,702 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(2,826 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,131       81.60       81.60
{txt}          1 {c |}{res}        255       18.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,386      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        186        6.75        6.75
{txt}          1 {c |}{res}      2,571       93.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,757      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote male age Han mar prim_scho lg_inc below_aver party submit cap compli no_influ i.region reli health read internet tv [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3005.9694}  
Iteration 1:{space 3}log pseudolikelihood = {res: -2849.408}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2848.8003}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2848.8003}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,143}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2848.8003}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0523}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2}  .204198{col 26}{space 2} .0730342{col 37}{space 1}    2.80{col 46}{space 3}0.005{col 54}{space 4} .0610537{col 67}{space 3} .3473424
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.0574819{col 26}{space 2} .0271737{col 37}{space 1}   -2.12{col 46}{space 3}0.034{col 54}{space 4}-.1107413{col 67}{space 3}-.0042224
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0006837{col 26}{space 2} .0017445{col 37}{space 1}    0.39{col 46}{space 3}0.695{col 54}{space 4}-.0027355{col 67}{space 3}  .004103
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.3739236{col 26}{space 2} .0335931{col 37}{space 1}  -11.13{col 46}{space 3}0.000{col 54}{space 4}-.4397649{col 67}{space 3}-.3080823
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.1213478{col 26}{space 2} .0313245{col 37}{space 1}   -3.87{col 46}{space 3}0.000{col 54}{space 4}-.1827427{col 67}{space 3}-.0599529
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}-.1270617{col 26}{space 2} .0369956{col 37}{space 1}   -3.43{col 46}{space 3}0.001{col 54}{space 4}-.1995717{col 67}{space 3}-.0545516
{txt}{space 6}lg_inc {c |}{col 14}{res}{space 2}-.0197538{col 26}{space 2} .0041606{col 37}{space 1}   -4.75{col 46}{space 3}0.000{col 54}{space 4}-.0279083{col 67}{space 3}-.0115992
{txt}{space 2}below_aver {c |}{col 14}{res}{space 2}-.1457975{col 26}{space 2} .0498181{col 37}{space 1}   -2.93{col 46}{space 3}0.003{col 54}{space 4}-.2434392{col 67}{space 3}-.0481557
{txt}{space 7}party {c |}{col 14}{res}{space 2} .0635185{col 26}{space 2}  .036719{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.0084493{col 67}{space 3} .1354864
{txt}{space 6}submit {c |}{col 14}{res}{space 2} .4970042{col 26}{space 2} .0187051{col 37}{space 1}   26.57{col 46}{space 3}0.000{col 54}{space 4} .4603429{col 67}{space 3} .5336655
{txt}{space 9}cap {c |}{col 14}{res}{space 2} .0190789{col 26}{space 2} .0415382{col 37}{space 1}    0.46{col 46}{space 3}0.646{col 54}{space 4}-.0623344{col 67}{space 3} .1004922
{txt}{space 6}compli {c |}{col 14}{res}{space 2} .0295217{col 26}{space 2} .0566849{col 37}{space 1}    0.52{col 46}{space 3}0.603{col 54}{space 4}-.0815787{col 67}{space 3} .1406221
{txt}{space 4}no_influ {c |}{col 14}{res}{space 2}-.0479742{col 26}{space 2} .0265749{col 37}{space 1}   -1.81{col 46}{space 3}0.071{col 54}{space 4}  -.10006{col 67}{space 3} .0041115
{txt}{space 12} {c |}
{space 6}region {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .4291091{col 26}{space 2} .0912361{col 37}{space 1}    4.70{col 46}{space 3}0.000{col 54}{space 4} .2502896{col 67}{space 3} .6079286
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0562015{col 26}{space 2} .1988255{col 37}{space 1}   -0.28{col 46}{space 3}0.777{col 54}{space 4}-.4458922{col 67}{space 3} .3334892
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .1987185{col 26}{space 2} .1279979{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4}-.0521528{col 67}{space 3} .4495898
{txt}{space 12} {c |}
{space 8}reli {c |}{col 14}{res}{space 2}-.1494884{col 26}{space 2} .0678732{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-.2825175{col 67}{space 3}-.0164593
{txt}{space 6}health {c |}{col 14}{res}{space 2} .0466112{col 26}{space 2} .0648075{col 37}{space 1}    0.72{col 46}{space 3}0.472{col 54}{space 4}-.0804091{col 67}{space 3} .1736315
{txt}{space 8}read {c |}{col 14}{res}{space 2} .0482179{col 26}{space 2} .0521196{col 37}{space 1}    0.93{col 46}{space 3}0.355{col 54}{space 4}-.0539347{col 67}{space 3} .1503704
{txt}{space 4}internet {c |}{col 14}{res}{space 2}-.1186526{col 26}{space 2} .0406727{col 37}{space 1}   -2.92{col 46}{space 3}0.004{col 54}{space 4}-.1983696{col 67}{space 3}-.0389355
{txt}{space 10}tv {c |}{col 14}{res}{space 2}-.0899683{col 26}{space 2} .0172034{col 37}{space 1}   -5.23{col 46}{space 3}0.000{col 54}{space 4}-.1236863{col 67}{space 3}-.0562503
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .571095{col 26}{space 2} .0789545{col 37}{space 1}    7.23{col 46}{space 3}0.000{col 54}{space 4} .4163471{col 67}{space 3} .7258429
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,143    .6633491    .1215103   .2498649   .9490153
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(3,699 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(2,839 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,123       81.02       81.02
{txt}          1 {c |}{res}        263       18.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,386      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        181        6.57        6.57
{txt}          1 {c |}{res}      2,576       93.43      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,757      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote vote_male male age Han mar prim_scho lg_inc below_aver party submit cap compli no_influ i.region reli health read internet tv [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3005.9694}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2849.0636}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2848.4653}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2848.4653}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,143}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2848.4653}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0524}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .1702571{col 26}{space 2} .0840165{col 37}{space 1}    2.03{col 46}{space 3}0.043{col 54}{space 4} .0055877{col 67}{space 3} .3349265
{txt}{space 3}vote_male {c |}{col 14}{res}{space 2} .0669195{col 26}{space 2} .0221528{col 37}{space 1}    3.02{col 46}{space 3}0.003{col 54}{space 4} .0235008{col 67}{space 3} .1103381
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1003309{col 26}{space 2} .0138953{col 37}{space 1}   -7.22{col 46}{space 3}0.000{col 54}{space 4}-.1275652{col 67}{space 3}-.0730966
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0007066{col 26}{space 2} .0017462{col 37}{space 1}    0.40{col 46}{space 3}0.686{col 54}{space 4}-.0027158{col 67}{space 3} .0041291
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.3735611{col 26}{space 2} .0332339{col 37}{space 1}  -11.24{col 46}{space 3}0.000{col 54}{space 4}-.4386983{col 67}{space 3} -.308424
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.1222494{col 26}{space 2} .0315223{col 37}{space 1}   -3.88{col 46}{space 3}0.000{col 54}{space 4}-.1840319{col 67}{space 3}-.0604669
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}-.1255582{col 26}{space 2} .0372183{col 37}{space 1}   -3.37{col 46}{space 3}0.001{col 54}{space 4}-.1985047{col 67}{space 3}-.0526117
{txt}{space 6}lg_inc {c |}{col 14}{res}{space 2}-.0196655{col 26}{space 2} .0040987{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4}-.0276989{col 67}{space 3}-.0116322
{txt}{space 2}below_aver {c |}{col 14}{res}{space 2}-.1449877{col 26}{space 2} .0492216{col 37}{space 1}   -2.95{col 46}{space 3}0.003{col 54}{space 4}-.2414603{col 67}{space 3}-.0485152
{txt}{space 7}party {c |}{col 14}{res}{space 2} .0583681{col 26}{space 2} .0351989{col 37}{space 1}    1.66{col 46}{space 3}0.097{col 54}{space 4}-.0106205{col 67}{space 3} .1273567
{txt}{space 6}submit {c |}{col 14}{res}{space 2} .4976316{col 26}{space 2} .0184122{col 37}{space 1}   27.03{col 46}{space 3}0.000{col 54}{space 4} .4615443{col 67}{space 3} .5337189
{txt}{space 9}cap {c |}{col 14}{res}{space 2} .0186561{col 26}{space 2} .0408876{col 37}{space 1}    0.46{col 46}{space 3}0.648{col 54}{space 4}-.0614821{col 67}{space 3} .0987943
{txt}{space 6}compli {c |}{col 14}{res}{space 2} .0301152{col 26}{space 2} .0563918{col 37}{space 1}    0.53{col 46}{space 3}0.593{col 54}{space 4}-.0804107{col 67}{space 3} .1406412
{txt}{space 4}no_influ {c |}{col 14}{res}{space 2}-.0486646{col 26}{space 2} .0257936{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-.0992192{col 67}{space 3}   .00189
{txt}{space 12} {c |}
{space 6}region {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .4287187{col 26}{space 2} .0918685{col 37}{space 1}    4.67{col 46}{space 3}0.000{col 54}{space 4} .2486597{col 67}{space 3} .6087777
{txt}{space 10}3  {c |}{col 14}{res}{space 2} -.057007{col 26}{space 2} .1989232{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-.4468892{col 67}{space 3} .3328753
{txt}{space 10}4  {c |}{col 14}{res}{space 2}  .198403{col 26}{space 2} .1285013{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4} -.053455{col 67}{space 3}  .450261
{txt}{space 12} {c |}
{space 8}reli {c |}{col 14}{res}{space 2}-.1501823{col 26}{space 2} .0682972{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-.2840423{col 67}{space 3}-.0163224
{txt}{space 6}health {c |}{col 14}{res}{space 2} .0466431{col 26}{space 2} .0648248{col 37}{space 1}    0.72{col 46}{space 3}0.472{col 54}{space 4}-.0804112{col 67}{space 3} .1736974
{txt}{space 8}read {c |}{col 14}{res}{space 2} .0481815{col 26}{space 2} .0535021{col 37}{space 1}    0.90{col 46}{space 3}0.368{col 54}{space 4}-.0566806{col 67}{space 3} .1530436
{txt}{space 4}internet {c |}{col 14}{res}{space 2}-.1170981{col 26}{space 2} .0424685{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4}-.2003348{col 67}{space 3}-.0338613
{txt}{space 10}tv {c |}{col 14}{res}{space 2}-.0898106{col 26}{space 2} .0171074{col 37}{space 1}   -5.25{col 46}{space 3}0.000{col 54}{space 4}-.1233404{col 67}{space 3}-.0562809
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5886726{col 26}{space 2} .0846206{col 37}{space 1}    6.96{col 46}{space 3}0.000{col 54}{space 4} .4228192{col 67}{space 3} .7545259
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***F test
. test vote_male + vote=0

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[trust]vote + [trust]vote_male = 0{p_end}

{txt}{col 12}chi2(  1) ={res}   14.70
{txt}{col 10}Prob > chi2 =  {res}  0.0001
{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,143    .6632889    .1216021   .2424415   .9472258
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(3,695 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(2,835 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,123       81.02       81.02
{txt}          1 {c |}{res}        263       18.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,386      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        185        6.71        6.71
{txt}          1 {c |}{res}      2,572       93.29      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,757      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
. probit trust vote vote_party male age Han mar prim_scho lg_inc below_aver party submit cap compli no_influ i.region reli health read internet tv [pw=WEIGHT], robust cluster(stratum)

{res}{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-3005.9694}  
Iteration 1:{space 3}log pseudolikelihood = {res:-2849.3057}  
Iteration 2:{space 3}log pseudolikelihood = {res:-2848.6972}  
Iteration 3:{space 3}log pseudolikelihood = {res:-2848.6971}  
{res}
{txt}{col 1}Probit regression{col 57}{lalign 13:Number of obs}{col 70} = {res}{ralign 6:4,143}
{txt}{col 57}{lalign 13:{help j_robustsingular##|_new:Wald chi2(1)}}{col 70} = {res}{ralign 6:.}
{txt}{col 57}{lalign 13:Prob > chi2}{col 70} = {res}{ralign 6:.}
{txt}{col 1}{lalign 20:Log pseudolikelihood}{col 21} = {res}{ralign 10:-2848.6971}{txt}{col 57}{lalign 13:Pseudo R2}{col 70} = {res}{ralign 6:0.0523}

{txt}{ralign 78:(Std. err. adjusted for {res:3} clusters in {res:stratum})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       trust{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .2075829{col 26}{space 2} .0679662{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4} .0743716{col 67}{space 3} .3407942
{txt}{space 2}vote_party {c |}{col 14}{res}{space 2}-.1050052{col 26}{space 2} .1612728{col 37}{space 1}   -0.65{col 46}{space 3}0.515{col 54}{space 4}-.4210941{col 67}{space 3} .2110837
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.0572785{col 26}{space 2} .0273355{col 37}{space 1}   -2.10{col 46}{space 3}0.036{col 54}{space 4}-.1108552{col 67}{space 3}-.0037018
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0006681{col 26}{space 2} .0017332{col 37}{space 1}    0.39{col 46}{space 3}0.700{col 54}{space 4}-.0027288{col 67}{space 3} .0040651
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.3730205{col 26}{space 2} .0321197{col 37}{space 1}  -11.61{col 46}{space 3}0.000{col 54}{space 4}-.4359739{col 67}{space 3}-.3100672
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.1214903{col 26}{space 2} .0318495{col 37}{space 1}   -3.81{col 46}{space 3}0.000{col 54}{space 4}-.1839141{col 67}{space 3}-.0590664
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}-.1270984{col 26}{space 2} .0369594{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.1995375{col 67}{space 3}-.0546593
{txt}{space 6}lg_inc {c |}{col 14}{res}{space 2}-.0197611{col 26}{space 2} .0042362{col 37}{space 1}   -4.66{col 46}{space 3}0.000{col 54}{space 4}-.0280639{col 67}{space 3}-.0114583
{txt}{space 2}below_aver {c |}{col 14}{res}{space 2} -.146345{col 26}{space 2}  .050597{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-.2455132{col 67}{space 3}-.0471768
{txt}{space 7}party {c |}{col 14}{res}{space 2} .1516832{col 26}{space 2} .1719767{col 37}{space 1}    0.88{col 46}{space 3}0.378{col 54}{space 4}-.1853849{col 67}{space 3} .4887514
{txt}{space 6}submit {c |}{col 14}{res}{space 2} .4966137{col 26}{space 2} .0191511{col 37}{space 1}   25.93{col 46}{space 3}0.000{col 54}{space 4} .4590783{col 67}{space 3}  .534149
{txt}{space 9}cap {c |}{col 14}{res}{space 2} .0195083{col 26}{space 2} .0425601{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 54}{space 4}-.0639079{col 67}{space 3} .1029245
{txt}{space 6}compli {c |}{col 14}{res}{space 2} .0300833{col 26}{space 2} .0557835{col 37}{space 1}    0.54{col 46}{space 3}0.590{col 54}{space 4}-.0792502{col 67}{space 3} .1394169
{txt}{space 4}no_influ {c |}{col 14}{res}{space 2}-.0481194{col 26}{space 2} .0264566{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-.0999734{col 67}{space 3} .0037346
{txt}{space 12} {c |}
{space 6}region {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .4286036{col 26}{space 2} .0925214{col 37}{space 1}    4.63{col 46}{space 3}0.000{col 54}{space 4}  .247265{col 67}{space 3} .6099421
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0561612{col 26}{space 2}  .199437{col 37}{space 1}   -0.28{col 46}{space 3}0.778{col 54}{space 4}-.4470506{col 67}{space 3} .3347282
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .1985536{col 26}{space 2} .1286965{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4}-.0536869{col 67}{space 3}  .450794
{txt}{space 12} {c |}
{space 8}reli {c |}{col 14}{res}{space 2} -.149518{col 26}{space 2} .0681538{col 37}{space 1}   -2.19{col 46}{space 3}0.028{col 54}{space 4}-.2830969{col 67}{space 3}-.0159391
{txt}{space 6}health {c |}{col 14}{res}{space 2} .0460921{col 26}{space 2} .0641577{col 37}{space 1}    0.72{col 46}{space 3}0.472{col 54}{space 4}-.0796546{col 67}{space 3} .1718389
{txt}{space 8}read {c |}{col 14}{res}{space 2} .0482988{col 26}{space 2}  .051975{col 37}{space 1}    0.93{col 46}{space 3}0.353{col 54}{space 4}-.0535704{col 67}{space 3}  .150168
{txt}{space 4}internet {c |}{col 14}{res}{space 2}-.1191228{col 26}{space 2} .0398774{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4} -.197281{col 67}{space 3}-.0409646
{txt}{space 10}tv {c |}{col 14}{res}{space 2}-.0894925{col 26}{space 2} .0163345{col 37}{space 1}   -5.48{col 46}{space 3}0.000{col 54}{space 4}-.1215075{col 67}{space 3}-.0574775
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .569185{col 26}{space 2} .0752441{col 37}{space 1}    7.56{col 46}{space 3}0.000{col 54}{space 4} .4217093{col 67}{space 3} .7166608
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. ***F test
. test vote_party + vote=0

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[trust]vote + [trust]vote_party = 0{p_end}

{txt}{col 12}chi2(  1) ={res}    0.20
{txt}{col 10}Prob > chi2 =  {res}  0.6536
{txt}
{com}. ***margin
. margin,dydx(*)
{res}
{txt}{col 1}Average marginal effects{col 58}{lalign 13:Number of obs}{col 71} = {res}{ralign 5:4,143}
{txt}{col 1}Model VCE: {res:Robust}

{txt}{p2colset 1 13 13 2}{...}
{p2col:Expression:}{res:Pr(trust), predict()}{p_end}
{p2col:dy/dx wrt:}{res:vote vote_party male age Han mar prim_scho lg_inc below_aver party submit cap compli no_influ 2.region 3.region 4.region reli health read internet tv}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}vote {c |}{col 14}{res}{space 2} .0718495{col 26}{space 2} .0225166{col 37}{space 1}    3.19{col 46}{space 3}0.001{col 54}{space 4} .0277178{col 67}{space 3} .1159812
{txt}{space 2}vote_party {c |}{col 14}{res}{space 2}-.0363449{col 26}{space 2} .0563349{col 37}{space 1}   -0.65{col 46}{space 3}0.519{col 54}{space 4}-.1467592{col 67}{space 3} .0740695
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.0198255{col 26}{space 2} .0091808{col 37}{space 1}   -2.16{col 46}{space 3}0.031{col 54}{space 4}-.0378195{col 67}{space 3}-.0018315
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0002313{col 26}{space 2} .0006031{col 37}{space 1}    0.38{col 46}{space 3}0.701{col 54}{space 4}-.0009509{col 67}{space 3} .0014134
{txt}{space 9}Han {c |}{col 14}{res}{space 2}-.1291115{col 26}{space 2} .0129444{col 37}{space 1}   -9.97{col 46}{space 3}0.000{col 54}{space 4} -.154482{col 67}{space 3} -.103741
{txt}{space 9}mar {c |}{col 14}{res}{space 2}-.0420507{col 26}{space 2} .0116123{col 37}{space 1}   -3.62{col 46}{space 3}0.000{col 54}{space 4}-.0648105{col 67}{space 3} -.019291
{txt}{space 3}prim_scho {c |}{col 14}{res}{space 2}-.0439919{col 26}{space 2} .0121735{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}-.0678515{col 67}{space 3}-.0201323
{txt}{space 6}lg_inc {c |}{col 14}{res}{space 2}-.0068398{col 26}{space 2} .0013727{col 37}{space 1}   -4.98{col 46}{space 3}0.000{col 54}{space 4}-.0095303{col 67}{space 3}-.0041493
{txt}{space 2}below_aver {c |}{col 14}{res}{space 2}-.0506536{col 26}{space 2} .0182131{col 37}{space 1}   -2.78{col 46}{space 3}0.005{col 54}{space 4}-.0863505{col 67}{space 3}-.0149566
{txt}{space 7}party {c |}{col 14}{res}{space 2} .0525013{col 26}{space 2} .0602668{col 37}{space 1}    0.87{col 46}{space 3}0.384{col 54}{space 4}-.0656196{col 67}{space 3} .1706221
{txt}{space 6}submit {c |}{col 14}{res}{space 2} .1718901{col 26}{space 2} .0049139{col 37}{space 1}   34.98{col 46}{space 3}0.000{col 54}{space 4} .1622591{col 67}{space 3} .1815211
{txt}{space 9}cap {c |}{col 14}{res}{space 2} .0067523{col 26}{space 2} .0148261{col 37}{space 1}    0.46{col 46}{space 3}0.649{col 54}{space 4}-.0223062{col 67}{space 3} .0358108
{txt}{space 6}compli {c |}{col 14}{res}{space 2} .0104126{col 26}{space 2} .0191608{col 37}{space 1}    0.54{col 46}{space 3}0.587{col 54}{space 4} -.027142{col 67}{space 3} .0479671
{txt}{space 4}no_influ {c |}{col 14}{res}{space 2}-.0166553{col 26}{space 2} .0089232{col 37}{space 1}   -1.87{col 46}{space 3}0.062{col 54}{space 4}-.0341444{col 67}{space 3} .0008339
{txt}{space 12} {c |}
{space 6}region {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1413846{col 26}{space 2}  .033307{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 54}{space 4} .0761041{col 67}{space 3} .2066651
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0205234{col 26}{space 2} .0729759{col 37}{space 1}   -0.28{col 46}{space 3}0.779{col 54}{space 4}-.1635536{col 67}{space 3} .1225067
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0693212{col 26}{space 2} .0454467{col 37}{space 1}    1.53{col 46}{space 3}0.127{col 54}{space 4}-.0197526{col 67}{space 3} .1583951
{txt}{space 12} {c |}
{space 8}reli {c |}{col 14}{res}{space 2}-.0517518{col 26}{space 2} .0228572{col 37}{space 1}   -2.26{col 46}{space 3}0.024{col 54}{space 4}-.0965512{col 67}{space 3}-.0069524
{txt}{space 6}health {c |}{col 14}{res}{space 2} .0159536{col 26}{space 2} .0224324{col 37}{space 1}    0.71{col 46}{space 3}0.477{col 54}{space 4}-.0280131{col 67}{space 3} .0599203
{txt}{space 8}read {c |}{col 14}{res}{space 2} .0167174{col 26}{space 2} .0177533{col 37}{space 1}    0.94{col 46}{space 3}0.346{col 54}{space 4}-.0180785{col 67}{space 3} .0515133
{txt}{space 4}internet {c |}{col 14}{res}{space 2}-.0412313{col 26}{space 2} .0132653{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-.0672308{col 67}{space 3}-.0152318
{txt}{space 10}tv {c |}{col 14}{res}{space 2}-.0309755{col 26}{space 2} .0060856{col 37}{space 1}   -5.09{col 46}{space 3}0.000{col 54}{space 4} -.042903{col 67}{space 3}-.0190481
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 0 78}Note: dy/dx for factor levels is the discrete change from the base level.{txt}{p_end}
{res}{txt}
{com}. ***correctness
. predict phat
{txt}(option {bf:pr} assumed; Pr(trust))

{com}. sum phat

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}phat {c |}{res}      4,143    .6633839    .1215466   .2494466   .9489465
{txt}
{com}. gen binarypred = 0 if phat != .
{txt}
{com}. replace binarypred = 1 if phat > .5 & phat != .
{txt}(3,697 real changes made)

{com}. gen correctpred = 0 if phat != .
{txt}
{com}. replace correctpred = 1 if binarypred == trust
{txt}(2,839 real changes made)

{com}. tab correctpred if trust == 0

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,122       80.95       80.95
{txt}          1 {c |}{res}        264       19.05      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,386      100.00
{txt}
{com}. tab correctpred if trust == 1

{txt}correctpred {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        182        6.60        6.60
{txt}          1 {c |}{res}      2,575       93.40      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,757      100.00
{txt}
{com}. drop phat binarypred correctpred
{txt}
{com}. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/raymond/Desktop/georgetown/Spring_semester_2021-2022/TA for Jensen/office_hours/thesis_stata_code.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 Apr 2022, 11:17:20
{txt}{.-}
{smcl}
{txt}{sf}{ul off}